{
  "source_url": "https://my.clevelandclinic.org/health/articles/11920-cholesterol-numbers-what-do-they-mean",
  "chunks": [
    {
      "heading": "Why are my cholesterol numbers important?",
      "content": "Your cholesterol levels are important because they help you know your risk for heart disease. Cholesterol is a type of lipid (fat) that helps your body perform many important functions. But too much cholesterol in your blood is harmful. It can enter your artery wall, damage its integrity and lead to atherosclerotic plaque (hardened deposits) forming.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nThis process of plaque buildup is called atherosclerosis. It can lead to serious problems like:\nCoronary artery disease: Blocked blood flow to your heart.Peripheral artery disease: Blocked blood flow to your legs and arms.Carotid artery disease: Blocked blood flow to your brain.\nCoronary artery disease: Blocked blood flow to your heart.\nPeripheral artery disease: Blocked blood flow to your legs and arms.\nCarotid artery disease: Blocked blood flow to your brain.\nCholesterol travels through your blood silently. And it turns into plaque silently. Plaque buildup is like someone tiptoeing on a carpet. You might not see or notice its presence for a long time. You may have no symptoms until you have a heart attack or stroke. At that point, the plaque is like high heels on a hardwood floor. And it’s already caused serious damage to your body.\nYou can live for many years with high cholesterol and not even know it. That’s why it’s essential to get your cholesterol numbers checked on a regular basis. If your cholesterol numbers are too high (hyperlipidemia), that’s a red flag for you and your healthcare provider.\nMany people have high cholesterol, which is a major risk factor for heart disease. But you’re not stuck with the cholesterol numbers you have. It’s possible to change them. Catching high cholesterol early gives you a chance to make changes and achieve good cholesterol numbers.\nAdvertisement"
    },
    {
      "heading": "What cholesterol levels are tested?",
      "content": "The main cholesterol levels your provider checks are:\nTotal cholesterol. This is the total amount of cholesterol that’s circulating in your blood.LDL or low-density lipoprotein. This is the “bad” cholesterol that contributes to plaque buildup in your arteries, leading to heart attacks and strokes.HDL or high-density lipoprotein. This is the “good” cholesterol that helps clear out the cholesterol your body doesn’t need.Triglycerides. This is a type of fat that can raise your heart attack and stroke risks.\nTotal cholesterol. This is the total amount of cholesterol that’s circulating in your blood.\nLDL or low-density lipoprotein. This is the “bad” cholesterol that contributes to plaque buildup in your arteries, leading to heart attacks and strokes.\nHDL or high-density lipoprotein. This is the “good” cholesterol that helps clear out the cholesterol your body doesn’t need.\nTriglycerides. This is a type of fat that can raise your heart attack and stroke risks.\nYour provider checks your cholesterol levels with a blood test they call a lipid panel (or lipid profile). A provider will draw blood from a vein in your arm and send the blood to a lab for analysis. Be sure to closely follow your provider’s instructions on how to prepare for the test. You’ll likely need to fast for 12 hours beforehand. This means avoiding all foods and drinks except water.\nWhen your results come in, your provider will let you know. You may also be able to access your results through your electronic medical record."
    },
    {
      "heading": "What is the unit of measurement for cholesterol?",
      "content": "Healthcare providers measure cholesterol levels as milligrams of cholesterol per deciliter of blood. The abbreviation is mg/dL. Providers use these same units to measure your triglycerides."
    },
    {
      "heading": "What are normal cholesterol levels?",
      "content": "Normal cholesterol levels vary based on your age, ethnicity and sex assigned at birth.\nThe chart below shows normal cholesterol levels. Healthcare providers consider these good cholesterol numbers for most people. If you have heart disease or many risk factors, your LDL target may be different. Your healthcare provider may want your LDL level to be below 70 mg/dL. So, it’s important to talk with your provider about your test results and what they mean for you.\nAll units in the chart below are mg/dL.\nAs you review your results, remember that you want your LDL to be low and your HDL to be high. Ideally, your HDL should be above 60 to offer you protection against heart disease.\nMost normal cholesterol levels are the same regardless of your sex. But there’s one key difference among adults. That’s your HDL number. As the chart above shows, people assigned female at birth (AFAB) need a higher HDL level (at least 50) compared to people assigned male at birth (AMAB) (at least 40)."
    },
    {
      "heading": "What’s considered high cholesterol?",
      "content": "High cholesterol generally means your total cholesterol is 200 mg/dL or higher. But providers use additional categories like “borderline high” and “near optimal” to break down your results. If your numbers are close to normal levels, they may be easier to manage through lifestyle and dietary changes.\nAdvertisement\nThe chart below shows cholesterol levels that are higher than normal. All units are mg/dL."
    },
    {
      "heading": "Can cholesterol levels be too low or too high?",
      "content": "There are upper limits for your total cholesterol. Lower is better — as low as you can go. Researchers have found that a lower LDL is better. They haven’t set a lower limit for it. The higher your HDL number is, the better it is for you. So your LDL can’t be too low and your HDL can’t be too high."
    },
    {
      "heading": "How often should I get my cholesterol checked?",
      "content": "Your provider will tell you how often you need your cholesterol checked. It depends on your:\nAge: The older you get, the more often you need to have your numbers checked.Family history: If you have a close biological family member with a history of heart disease, you face a higher risk of heart problems, too. You may need cholesterol tests more often if your family member has high cholesterol or a history of heart attack or stroke.Risk factors for heart disease: If you have a heart disease diagnosis or risk factors, you’ll need cholesterol tests more often.Sex assigned at birth: People assigned male at birth need more frequent tests starting at a younger age compared to people assigned female at birth.\nAge: The older you get, the more often you need to have your numbers checked.\nFamily history: If you have a close biological family member with a history of heart disease, you face a higher risk of heart problems, too. You may need cholesterol tests more often if your family member has high cholesterol or a history of heart attack or stroke.\nRisk factors for heart disease: If you have a heart disease diagnosis or risk factors, you’ll need cholesterol tests more often.\nSex assigned at birth: People assigned male at birth need more frequent tests starting at a younger age compared to people assigned female at birth.\nChildren should get their first test between ages 9 and 11. Then, they should receive a test every five years. Your child’s provider may recommend starting at a younger age based on family history.\nAdvertisement\nHere are general guidelines for adults based on sex and age.\nA note from Cleveland Clinic\nKnowing your cholesterol numbers can help you learn your risk for heart disease. But keep in mind that your cholesterol numbers are just part of the story. Your provider will also look at other aspects of your health to learn more about your risks. So, if your numbers fall outside the normal range, don’t panic. Talk with your provider about what your cholesterol levels mean in the context of your overall health. And work with your provider to get your numbers back to a healthier place.\nAdvertisement\nLast reviewed on 07/19/2022.\nLearn more about the Health Library and our editorial process."
    }
  ]
}