{
  "source_url": "https://my.clevelandclinic.org/health/drugs/19162-lisinopril-tablets",
  "chunks": [
    {
      "heading": "What is this medication?",
      "content": "LISINOPRIL (lyse IN oh pril) treats high blood pressure and heart failure. It may also be used to prevent further damage after a heart attack. It works by relaxing blood vessels, which decreases the amount of work the heart has to do. It belongs to a group of medications called ACE inhibitors.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nThis medicine may be used for other purposes; ask your health care provider or pharmacist if you have questions.\nCOMMON BRAND NAME(S): Prinivil, Zestril"
    },
    {
      "heading": "What should I tell my care team before I take this medication?",
      "content": "They need to know if you have any of these conditions:\nDiabetesHeart or blood vessel diseaseHistory of swelling of the tongue, face, or lips with difficulty breathing, difficulty swallowing, hoarseness, or tightening of the throat (angioedema)Kidney diseaseLow blood pressureAn unusual or allergic reaction to lisinopril, other ACE inhibitors, insect venom, foods, dyes, or preservativesPregnant or trying to get pregnantBreast-feeding\nDiabetes\nHeart or blood vessel disease\nHistory of swelling of the tongue, face, or lips with difficulty breathing, difficulty swallowing, hoarseness, or tightening of the throat (angioedema)\nKidney disease\nLow blood pressure\nAn unusual or allergic reaction to lisinopril, other ACE inhibitors, insect venom, foods, dyes, or preservatives\nPregnant or trying to get pregnant\nBreast-feeding"
    },
    {
      "heading": "How should I use this medication?",
      "content": "Take this medication by mouth. Take it as directed on the prescription label at the same time every day. You can take it with or without food. If it upsets your stomach, take it with food. Keep taking it unless your care team tells you to stop.\nTalk to your care team about the use of this medication in children. While it may be prescribed for children as young as 6 for selected conditions, precautions do apply.\nOverdosage: If you think you have taken too much of this medicine contact a poison control center or emergency room at once.\nNOTE: This medicine is only for you. Do not share this medicine with others."
    },
    {
      "heading": "What if I miss a dose?",
      "content": "If you miss a dose, take it as soon as you can. If it is almost time for your next dose, take only that dose. Do not take double or extra doses.\nAdvertisement"
    },
    {
      "heading": "What may interact with this medication?",
      "content": "Do not take this medication with any of the following:\nHymenoptera venomSacubitril; valsartan\nHymenoptera venom\nSacubitril; valsartan\nThis medication may also interact with the following:\nAliskirenAngiotensin receptor blockers, like losartan or valsartanCertain medications for diabetesDiureticsEverolimusGold compoundsLithiumNSAIDs, medications for pain and inflammation, like ibuprofen or naproxenPotassium salts or supplementsSalt substitutesSirolimusTemsirolimus\nAliskiren\nAngiotensin receptor blockers, like losartan or valsartan\nCertain medications for diabetes\nDiuretics\nEverolimus\nGold compounds\nLithium\nNSAIDs, medications for pain and inflammation, like ibuprofen or naproxen\nPotassium salts or supplements\nSalt substitutes\nSirolimus\nTemsirolimus\nThis list may not describe all possible interactions. Give your health care provider a list of all the medicines, herbs, non-prescription drugs, or dietary supplements you use. Also tell them if you smoke, drink alcohol, or use illegal drugs. Some items may interact with your medicine."
    },
    {
      "heading": "What should I watch for while using this medication?",
      "content": "Visit your health care provider for regular check-ups. Check your blood pressure as directed. Ask your health care provider what your blood pressure should be. Also, find out when you should contact him or her.\nDo not treat yourself for coughs, colds, or pain while you are using this medication without asking your health care provider for advice. Some medications may increase your blood pressure.\nInform your health care provider if you wish to become pregnant or think you might be pregnant. There is a potential for serious side effects to an unborn child. Talk to your health care provider for more information.\nYou may get drowsy or dizzy. Do not drive, use machinery, or do anything that needs mental alertness until you know how this medication affects you. Do not stand or sit up quickly, especially if you are an older patient. This reduces the risk of dizzy or fainting spells. Alcohol can make you more drowsy and dizzy. Avoid alcoholic drinks.\nAvoid salt substitutes unless you are told otherwise by your health care provider."
    },
    {
      "heading": "What side effects may I notice from receiving this medication?",
      "content": "Side effects that you should report to your care team as soon as possible:\nAllergic reactions or angioedema—skin rash, itching, hives, swelling of the face, eyes, lips, tongue, arms, or legs, trouble swallowing or breathingHigh potassium level—muscle weakness, fast or irregular heartbeatKidney injury—decrease in the amount of urine, swelling of the ankles, hands, or feetLiver injury—right upper belly pain, loss of appetite, nausea, light-colored stool, dark yellow or brown urine, yellowing skin or eyes, unusual weakness, fatigueLow blood pressure—dizziness, feeling faint or lightheaded, blurry vision\nAllergic reactions or angioedema—skin rash, itching, hives, swelling of the face, eyes, lips, tongue, arms, or legs, trouble swallowing or breathing\nHigh potassium level—muscle weakness, fast or irregular heartbeat\nKidney injury—decrease in the amount of urine, swelling of the ankles, hands, or feet\nLiver injury—right upper belly pain, loss of appetite, nausea, light-colored stool, dark yellow or brown urine, yellowing skin or eyes, unusual weakness, fatigue\nLow blood pressure—dizziness, feeling faint or lightheaded, blurry vision\nSide effects that usually do not require medical attention (report to your care team if they continue or are bothersome):\nCoughDizzinessHeadache\nCough\nDizziness\nHeadache\nThis list may not describe all possible side effects. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088.\nAdvertisement"
    },
    {
      "heading": "Where should I keep my medication?",
      "content": "Keep out of the reach of children and pets.\nStore at room temperature between 20 and 25 degrees C (68 and 77 degrees F). Protect from moisture. Keep the container tightly closed. Do not freeze. Avoid exposure to extreme heat. Get rid of any unused medication after the expiration date.\nTo get rid of medications that are no longer needed or have expired:\nTake the medication to a medication take-back program. Check with your pharmacy or law enforcement to find a location.If you cannot return the medication, check the label or package insert to see if the medication should be thrown out in the garbage or flushed down the toilet. If you are not sure, ask your care team. If it is safe to put in the trash, empty the medication out of the container. Mix the medication with cat litter, dirt, coffee grounds, or other unwanted substance. Seal the mixture in a bag or container. Put it in the trash.\nTake the medication to a medication take-back program. Check with your pharmacy or law enforcement to find a location.\nIf you cannot return the medication, check the label or package insert to see if the medication should be thrown out in the garbage or flushed down the toilet. If you are not sure, ask your care team. If it is safe to put in the trash, empty the medication out of the container. Mix the medication with cat litter, dirt, coffee grounds, or other unwanted substance. Seal the mixture in a bag or container. Put it in the trash.\nNOTE: This sheet is a summary. It may not cover all possible information. If you have questions about this medicine, talk to your doctor, pharmacist, or health care provider.\nAdvertisement\nCopyright ©2024 Elsevier Inc. All Rights Reserved.\nTerms of use.\nNote: Introduction and Additional Common Questions written and medically approved by Cleveland Clinic professionals."
    }
  ]
}