{
  "source_url": "https://my.clevelandclinic.org/health/treatments/22060-angioplasty",
  "chunks": [
    {
      "heading": "What is angioplasty?",
      "content": "Angioplasty, also called balloon angioplasty, is a procedure that opens arteries to let blood go through more easily. Healthcare providers use this minimally invasive procedure in tight spots in arteries where plaque makes the space inside an artery too narrow or blocks it.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy"
    },
    {
      "heading": "Who needs to have angioplasty?",
      "content": "People who have coronary artery disease or a heart attack may need to have coronary angioplasty. Angioplasty is also used in other parts of the body that have narrow or blocked arteries, such as your neck, arms and legs, kidneys and pelvis. Angioplasty allows more blood to get through an artery that’s too narrow or blocked with plaque. This means the organ that artery reaches will get a better supply of blood after angioplasty."
    },
    {
      "heading": "What does angioplasty treat?",
      "content": "Angioplasty treats atherosclerosis (a collection of plaque made of fat and cholesterol) in your arteries in several different places in your body.\nCoronary artery disease. Coronary angioplasty, or percutaneous coronary intervention, can help you if you have a narrow or blocked coronary artery that’s keeping your heart from getting the oxygen it needs, causing chest pain and/or a heart attack.Peripheral artery disease. Angioplasty treats atherosclerosis in the major arteries in your arms, legs and pelvis.Carotid artery disease. Angioplasty can help with blocked arteries in your neck. Left untreated, they can lead to a stroke if your brain isn’t getting enough oxygen.Chronic kidney disease. When plaque collects in the arteries in your kidneys, it affects how much oxygen can reach your kidneys. Sometimes a renal artery angioplasty can help.\nCoronary artery disease. Coronary angioplasty, or percutaneous coronary intervention, can help you if you have a narrow or blocked coronary artery that’s keeping your heart from getting the oxygen it needs, causing chest pain and/or a heart attack.\nPeripheral artery disease. Angioplasty treats atherosclerosis in the major arteries in your arms, legs and pelvis.\nCarotid artery disease. Angioplasty can help with blocked arteries in your neck. Left untreated, they can lead to a stroke if your brain isn’t getting enough oxygen.\nChronic kidney disease. When plaque collects in the arteries in your kidneys, it affects how much oxygen can reach your kidneys. Sometimes a renal artery angioplasty can help.\nAdvertisement"
    },
    {
      "heading": "How common is angioplasty?",
      "content": "Coronary angioplasty is one of America’s most common procedures."
    },
    {
      "heading": "What happens before angioplasty?",
      "content": "Your provider will usually ask you to stop drinking or eating for a few hours before your angioplasty procedure. You can plan on your angioplasty procedure taking a half-hour to a few hours, depending on your situation.\nAt the hospital, you’ll put on a hospital gown. You’ll need to tell your provider what medicines you take and what allergies you have. Your healthcare provider will put an IV in your arm to give you medicine that will relax you. You’ll still be able to respond to your provider’s questions. You’ll also get medicine in your IV that will keep your body from making blood clots."
    },
    {
      "heading": "What happens during angioplasty?",
      "content": "This description will be about a coronary angioplasty, but providers perform angioplasty in a similar way on other parts of your body. However, they may put the catheter in through a different artery than they would for the heart.\nYour provider puts a catheter or tube through your skin and into a blood vessel in your wrist or groin. They use medicine to keep you from feeling the tube go into your body.With X-rays to help find the way, a cardiologist, or heart expert, moves the catheter (tube) through your blood vessels to get to your blocked or narrowed coronary artery. You might feel warm briefly when they release a dye through the catheter to make it easier to see your blood vessels.When they get to the problem area, your provider will put in a wire and another catheter (a balloon catheter) that has a very small balloon at the end of it.Once they inflate the balloon, it moves the plaque out of the way and off to the side of the artery wall. This clears the way for blood to get through. Your narrow coronary artery is like a crowded subway car with people blocking the aisle. In order for people to get through the aisle, others need to move closer to the walls. The catheter balloon is like a football team that would force everyone to the side of the subway car so they could get through the aisle. Your provider will usually then put in a stent, a small hollow scaffold made of metal. Stronger than a balloon, the stent keeps the artery open after balloon removal.\nYour provider puts a catheter or tube through your skin and into a blood vessel in your wrist or groin. They use medicine to keep you from feeling the tube go into your body.\nWith X-rays to help find the way, a cardiologist, or heart expert, moves the catheter (tube) through your blood vessels to get to your blocked or narrowed coronary artery. You might feel warm briefly when they release a dye through the catheter to make it easier to see your blood vessels.\nWhen they get to the problem area, your provider will put in a wire and another catheter (a balloon catheter) that has a very small balloon at the end of it.\nOnce they inflate the balloon, it moves the plaque out of the way and off to the side of the artery wall. This clears the way for blood to get through. Your narrow coronary artery is like a crowded subway car with people blocking the aisle. In order for people to get through the aisle, others need to move closer to the walls. The catheter balloon is like a football team that would force everyone to the side of the subway car so they could get through the aisle. Your provider will usually then put in a stent, a small hollow scaffold made of metal. Stronger than a balloon, the stent keeps the artery open after balloon removal.\nThe stent, which your provider expands and locks into position after it’s put in your artery, stays inside your artery long after the angioplasty is done. Many stents have a drug coating that helps prevent your artery from getting too narrow again.\nIf you have peripheral artery disease, your provider may use a balloon that transfers its medicine coating to the artery wall. The drug stays behind after the balloon is taken out.\nYou may feel some discomfort when your provider inflates the balloon, but that goes away when they deflate it. Your healthcare provider deflates the balloon after it has done its job. The balloon can be inflated a couple of times in the same spot or in another blocked artery in your body.\nUsing an angiogram (X-ray images of your blood vessels), your provider can compare how well your blood flowed before and after your angioplasty to see how well it worked."
    },
    {
      "heading": "What happens after angioplasty?",
      "content": "Your provider will take out the catheters and use a bandage to cover the place where the catheters went into your skin. You may feel someone pressing on the wound to stop the bleeding. You might be sore or have a bruise there later."
    },
    {
      "heading": "What are the advantages of angioplasty?",
      "content": "Benefits of angioplasty include:\nIt has less risk and a lower cost than a surgical procedure.You’ll only have one wound from where the catheters were and a smaller wound from your IV.Your provider can put in a stent during your angioplasty if you need it.\nIt has less risk and a lower cost than a surgical procedure.\nYou’ll only have one wound from where the catheters were and a smaller wound from your IV.\nYour provider can put in a stent during your angioplasty if you need it.\nAdvertisement"
    },
    {
      "heading": "What are the risks or complications of angioplasty?",
      "content": "It’s rare to have serious complications after an angioplasty, but every invasive procedure comes with occasional risks. For example, you may need an emergency coronary artery bypass graft during or soon after an angioplasty. Complications happen in around one in 100 procedures, although this might be higher or lower depending on your individual circumstances.\nOther angioplasty risks include:\nA reaction to the dye.Heart attack.Abnormal heart rhythm.Stroke.Blood vessel or kidney damage.Blood clots.Chest pain.Bleeding.A repeat blockage if a stent isn’t placed in your artery.\nA reaction to the dye.\nHeart attack.\nAbnormal heart rhythm.\nStroke.\nBlood vessel or kidney damage.\nBlood clots.\nChest pain.\nBleeding.\nA repeat blockage if a stent isn’t placed in your artery.\nThe risk of angioplasty complications is higher for older adults or people who have several blocked arteries, kidney disease or heart failure."
    },
    {
      "heading": "What is the recovery time after angioplasty?",
      "content": "You’ll need to stay at the hospital for several hours or even overnight to recover from angioplasty. Your healthcare provider will tell you what medicines you need and how active you can be after your angioplasty. You’ll need to have someone drive you home from the hospital because you had anesthesia.\nGet rest at home and drink fluids. Don’t exert yourself for the next 24 hours. You may need to take medicines like aspirin or other blood thinners after your angioplasty procedure. If your healthcare provider prescribed blood thinners, it’s important to take these as directed. Do not miss any doses. If you think you need to stop taking blood thinners, you should discuss it with your provider before you do.\nAdvertisement"
    },
    {
      "heading": "When can I go back to work or drive?",
      "content": "You should be able to drive and go back to work about a week after your coronary angioplasty. The time may be shorter for other types of angioplasty. Check with your provider."
    },
    {
      "heading": "When should I see my healthcare provider?",
      "content": "You’ll have a follow-up visit after you go home, but you should contact your provider if:\nYou have bleeding or an infection where the catheters went through your skin.Your leg color changes.It hurts or feels warm where the catheters were.\nYou have bleeding or an infection where the catheters went through your skin.\nYour leg color changes.\nIt hurts or feels warm where the catheters were.\nYou should also tell your provider if you’re having trouble with the anticlotting medicine you take for three to 12 months after receiving a stent.\nA note from Cleveland Clinic\nAngioplasty can make a difference in how well your blood flows through an artery that had a collection of plaque in it. But even after a successful angioplasty and stent placement, it’s important to live a healthy lifestyle. This includes eating a healthy diet, exercising and not using tobacco products. Be sure to keep taking medicines your provider prescribed and go to all of your follow-up appointments.\nAdvertisement\nLast reviewed on 11/08/2021.\nLearn more about the Health Library and our editorial process."
    }
  ]
}