{
  "source_url": "https://my.clevelandclinic.org/health/drugs/20231-propranolol-tablets",
  "chunks": [
    {
      "heading": "What is this medication?",
      "content": "PROPRANOLOL (proe PRAN oh lole) treats many conditions such as high blood pressure, tremors, and a type of arrhythmia known as AFib (atrial fibrillation). It works by lowering your blood pressure and heart rate, making it easier for your heart to pump blood to the rest of your body. It may be used to prevent migraine headaches. It works by relaxing the blood vessels in the brain that cause migraines. It belongs to a group of medications called beta blockers.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nThis medicine may be used for other purposes; ask your health care provider or pharmacist if you have questions.\nCOMMON BRAND NAME(S): Inderal"
    },
    {
      "heading": "What should I tell my care team before I take this medication?",
      "content": "They need to know if you have any of these conditions:\nCirculation problems or blood vessel diseaseDiabetesHistory of heart attack or heart disease, vasospastic anginaKidney diseaseLiver diseaseLung or breathing disease, like asthma or emphysemaPheochromocytomaSlow heart rateThyroid diseaseAn unusual or allergic reaction to propranolol, other beta-blockers, medications, foods, dyes, or preservativesPregnant or trying to get pregnantBreast-feeding\nCirculation problems or blood vessel disease\nDiabetes\nHistory of heart attack or heart disease, vasospastic angina\nKidney disease\nLiver disease\nLung or breathing disease, like asthma or emphysema\nPheochromocytoma\nSlow heart rate\nThyroid disease\nAn unusual or allergic reaction to propranolol, other beta-blockers, medications, foods, dyes, or preservatives\nPregnant or trying to get pregnant\nBreast-feeding"
    },
    {
      "heading": "How should I use this medication?",
      "content": "Take this medication by mouth. Take it as directed on the prescription label at the same time every day. Keep taking it unless your care team tells you to stop.\nTalk to your care team about the use of this medication in children. Special care may be needed.\nOverdosage: If you think you have taken too much of this medicine contact a poison control center or emergency room at once.\nNOTE: This medicine is only for you. Do not share this medicine with others."
    },
    {
      "heading": "What if I miss a dose?",
      "content": "If you miss a dose, take it as soon as you can. If it is almost time for your next dose, take only that dose. Do not take double or extra doses."
    },
    {
      "heading": "What may interact with this medication?",
      "content": "Do not take this medication with any of the following:\nAdvertisement\nFeverfewPhenothiazines like chlorpromazine, mesoridazine, prochlorperazine, thioridazine\nFeverfew\nPhenothiazines like chlorpromazine, mesoridazine, prochlorperazine, thioridazine\nThis medication may also interact with the following:\nAluminum hydroxide gelAntipyrineAntiviral medications for HIV or AIDSBarbiturates like phenobarbitalCertain medications for blood pressure, heart disease, irregular heart beatCimetidineCiprofloxacinDiazepamFluconazoleHaloperidolIsoniazidMedications for cholesterol like cholestyramine or colestipolMedications for mental depressionMedications for migraine headache like almotriptan, eletriptan, frovatriptan, naratriptan, rizatriptan, sumatriptan, zolmitriptanNSAIDs, medications for pain and inflammation, like ibuprofen or naproxenPhenytoinRifampinTeniposideTheophyllineThyroid medicationsTolbutamideWarfarinZileuton\nAluminum hydroxide gel\nAntipyrine\nAntiviral medications for HIV or AIDS\nBarbiturates like phenobarbital\nCertain medications for blood pressure, heart disease, irregular heart beat\nCimetidine\nCiprofloxacin\nDiazepam\nFluconazole\nHaloperidol\nIsoniazid\nMedications for cholesterol like cholestyramine or colestipol\nMedications for mental depression\nMedications for migraine headache like almotriptan, eletriptan, frovatriptan, naratriptan, rizatriptan, sumatriptan, zolmitriptan\nNSAIDs, medications for pain and inflammation, like ibuprofen or naproxen\nPhenytoin\nRifampin\nTeniposide\nTheophylline\nThyroid medications\nTolbutamide\nWarfarin\nZileuton\nThis list may not describe all possible interactions. Give your health care provider a list of all the medicines, herbs, non-prescription drugs, or dietary supplements you use. Also tell them if you smoke, drink alcohol, or use illegal drugs. Some items may interact with your medicine."
    },
    {
      "heading": "What should I watch for while using this medication?",
      "content": "Visit your care team for regular checks on your progress. Check your blood pressure as directed. Ask your care team what your blood pressure should be. Also, find out when you should contact him or her.\nDo not treat yourself for coughs, colds, or pain while you are using this medication without asking your care team for advice. Some medications may increase your blood pressure.\nYou may get drowsy or dizzy. Do not drive, use machinery, or do anything that needs mental alertness until you know how this medication affects you. Do not stand up or sit up quickly, especially if you are an older patient. This reduces the risk of dizzy or fainting spells. Alcohol may interfere with the effect of this medication. Avoid alcoholic drinks.\nThis medication may increase blood sugar. Ask your care team if changes in diet or medications are needed if you have diabetes."
    },
    {
      "heading": "What side effects may I notice from receiving this medication?",
      "content": "Side effects that you should report to your care team as soon as possible:\nAllergic reactions—skin rash, itching, hives, swelling of the face, lips, tongue, or throatHeart failure—shortness of breath, swelling of the ankles, feet, or hands, sudden weight gain, unusual weakness or fatigueLow blood pressure—dizziness, feeling faint or lightheaded, blurry visionRaynaud's—cool, numb, or painful fingers or toes that may change color from pale, to blue, to redRedness, blistering, peeling, or loosening of the skin, including inside the mouthSlow heartbeat—dizziness, feeling faint or lightheaded, confusion, trouble breathing, unusual weakness or fatigueWorsening mood, feelings of depression\nAllergic reactions—skin rash, itching, hives, swelling of the face, lips, tongue, or throat\nHeart failure—shortness of breath, swelling of the ankles, feet, or hands, sudden weight gain, unusual weakness or fatigue\nLow blood pressure—dizziness, feeling faint or lightheaded, blurry vision\nRaynaud's—cool, numb, or painful fingers or toes that may change color from pale, to blue, to red\nRedness, blistering, peeling, or loosening of the skin, including inside the mouth\nSlow heartbeat—dizziness, feeling faint or lightheaded, confusion, trouble breathing, unusual weakness or fatigue\nWorsening mood, feelings of depression\nAdvertisement\nSide effects that usually do not require medical attention (report to your care team if they continue or are bothersome):\nChange in sex drive or performanceDiarrheaDizzinessFatigueHeadache\nChange in sex drive or performance\nDiarrhea\nDizziness\nFatigue\nHeadache\nThis list may not describe all possible side effects. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088."
    },
    {
      "heading": "Where should I keep my medication?",
      "content": "Keep out of the reach of children and pets.\nStore at room temperature between 20 and 25 degrees C (68 and 77 degrees F). Protect from light. Throw away any unused medication after the expiration date.\nNOTE: This sheet is a summary. It may not cover all possible information. If you have questions about this medicine, talk to your doctor, pharmacist, or health care provider.\nAdvertisement\nCopyright ©2024 Elsevier Inc. All Rights Reserved.\nTerms of use.\nNote: Introduction and Additional Common Questions written and medically approved by Cleveland Clinic professionals."
    }
  ]
}