{
  "source_url": "https://my.clevelandclinic.org/health/articles/10881-vital-signs",
  "chunks": [
    {
      "heading": "What are vital signs?",
      "content": "Vital signs measure your body’s basic functions. The measurements check your general physical health. They’re the first step of any medical exam or evaluation. Vital signs are important because they give a healthcare provider clues about any underlying conditions that affect your health or show your progress toward recovery.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nThere are four main vital signs:\nBody temperature.Blood pressure.Pulse (heart rate).Respiratory rate (breathing rate).\nBody temperature.\nBlood pressure.\nPulse (heart rate).\nRespiratory rate (breathing rate)."
    },
    {
      "heading": "What are normal vital signs?",
      "content": "Normal vital signs vary based on your age, BMI, sex and overall health."
    },
    {
      "heading": "What are pediatric vital signs?",
      "content": "Pediatric vital signs, or vital signs for children, measure your child’s basic body functions. The measurements are different for children than they are for adults. For example, a baby’s pulse may range from 110 to 160 beats per minute (bpm) and an adult’s heart rate ranges from 60 to 100 bpm."
    },
    {
      "heading": "What are orthostatic vital signs?",
      "content": "Orthostatic vital signs check your blood pressure and pulse when you’re lying down, and then when you’re standing up. Your vital signs may change when your position changes if you experienced or are at risk of:\nHypovolemia.Lightheadedness.Falling.Weakness.Loss of consciousness.Concussion.\nHypovolemia.\nLightheadedness.\nFalling.\nWeakness.\nLoss of consciousness.\nConcussion.\nOrthostatic vital signs are usually taken in a healthcare provider’s office or in a hospital setting."
    },
    {
      "heading": "What is body temperature?",
      "content": "Body temperature is the expected temperature of the human body. You may notice your body temperature change when you exercise or when you’re feeling ill.\nThe average body temperature is 98.6 degrees Fahrenheit (37 degrees Celsius), but the normal temperature for a healthy person can range between 97.8 F to 99.1 F (36.55 C to 37.27) or slightly higher.\nAdvertisement\nA temperature higher than 100.4 F (38 C) is classified as a fever. A drop in body temperature below 95 F (35 C) is hypothermia.\nYou can measure your body temperature at home by using a thermometer:\nIf using a temporal thermometer, place it hoovering just in front of your forehead. When using a traditional thermometer, insert the tip of the thermometer into your mouth or rectum or place it under your armpit.After a few seconds, remove the thermometer and read the temperature. Follow the instructions that came with your thermometer to get an accurate reading.Wash and sanitize your thermometer after each use.\nIf using a temporal thermometer, place it hoovering just in front of your forehead. When using a traditional thermometer, insert the tip of the thermometer into your mouth or rectum or place it under your armpit.\nAfter a few seconds, remove the thermometer and read the temperature. Follow the instructions that came with your thermometer to get an accurate reading.\nWash and sanitize your thermometer after each use.\nA healthcare provider can also measure your body temperature using a special thermometer inserted into your ear canal.\nFactors that can affect your body temperature include:\nBeing in a hot or cold environment.Exercise.Eating hot or cold foods and beverages.Strong emotions.\nBeing in a hot or cold environment.\nExercise.\nEating hot or cold foods and beverages.\nStrong emotions.\nMedical conditions that can cause your body temperature to change include:\nStress.Infection.Hypothyroidism.Dehydration.Sunburn.Rheumatoid arthritis.Hormonal changes.\nStress.\nInfection.\nHypothyroidism.\nDehydration.\nSunburn.\nRheumatoid arthritis.\nHormonal changes.\nAs you age, your body isn’t able to regulate your body temperature as well as it should. That’s why you may note more frequent temperature changes if you’re 65 or older."
    },
    {
      "heading": "What is blood pressure?",
      "content": "Blood pressure is the measurement of the pressure or force of blood against the walls of your arteries. Blood pressure is written as two numbers.\nSystolic pressure is the first number. It measures the pressure in your arteries when your heart beats and pushes blood out to your body.Diastolic pressure is the second number. It measures the pressure in your arteries when your heart rests between beats.\nSystolic pressure is the first number. It measures the pressure in your arteries when your heart beats and pushes blood out to your body.\nDiastolic pressure is the second number. It measures the pressure in your arteries when your heart rests between beats.\nHealthy blood pressure for an adult, relaxed at rest, is less than 120/80 mm Hg.\nYou can check your blood pressure at home by using a manual or digital blood pressure monitor (sphygmomanometer). To take an accurate blood pressure reading, you should:\nFind a quiet place to relax, sit down and place the blood pressure cuff around your arm.Inflate the cuff by following the instructions.Read the gauge on the cuff and write down the measurement.\nFind a quiet place to relax, sit down and place the blood pressure cuff around your arm.\nInflate the cuff by following the instructions.\nRead the gauge on the cuff and write down the measurement.\nSome drug stores or pharmacies offer an electronic blood pressure reading. Be aware that these aren’t considered accurate measurements of your blood pressure.\nHigh blood pressure, or hypertension, is a reading of 130/80 mmHg or higher. A systolic pressure of 130-139 or a diastolic pressure of 80-89 is considered high blood pressure stage 1.\nSystolic pressure greater than 140 and a diastolic pressure greater than 90 is considered high blood pressure stage 2. Your healthcare provider will discuss with you various treatment options based on your individual health.\nAdvertisement\nA systolic pressure greater than 180 and a diastolic pressure greater than 90 is considered a hypertensive crisis and you should consult your healthcare provider immediately.\nBlood pressure that remains high for an extended time, for example, longer than a few years, can cause health issues, including:\nAtherosclerosis (hardening of your arteries).Heart failure.Stroke.\nAtherosclerosis (hardening of your arteries).\nHeart failure.\nStroke.\nLow blood pressure (hypotension) is a reading of 90/60 mm Hg or lower. This can be normal for some people and not a cause for concern. However, low blood pressure can cause symptoms of an underlying health condition. Talk to your healthcare provider if you have a low blood pressure reading and experience:\nDizziness.Fainting.Nausea.Cold sweats.Blurred vision.\nDizziness.\nFainting.\nNausea.\nCold sweats.\nBlurred vision.\nPediatric blood pressure, or a child’s blood pressure, varies based on their age.\nA healthcare provider will check your child’s blood pressure during a routine appointment. Typically, blood pressure checks during well-child or regular appointments are the only times providers need to take your child’s blood pressure.\nFactors that can affect your blood pressure reading include, but aren’t limited to:\nCaffeine or beverages containing alcohol.Certain medications.Weight loss or weight gain.Cold temperatures.Exercise.A full bladder.A full stomach.The amount of salt in your diet.Smoking.Stress.\nCaffeine or beverages containing alcohol.\nCertain medications.\nWeight loss or weight gain.\nCold temperatures.\nExercise.\nA full bladder.\nA full stomach.\nThe amount of salt in your diet.\nSmoking.\nStress.\nAdvertisement\nIf you’re measuring your blood pressure, remember these factors when reading your results. If someone else is taking your blood pressure, tell them about any factors that may affect your measurement."
    },
    {
      "heading": "What is a pulse?",
      "content": "Your pulse is the number of times your heart beats per minute. A normal pulse rate for a healthy adult at rest ranges from 60 to 100 beats per minute (bpm). Pulse rates vary from person to person. Women or people assigned female at birth (AFAB) tend to have faster pulse rates than men or people assigned male at birth (AMAB).\nYour pulse is lower when you’re at rest and higher when you exercise. This happens because your body needs more oxygen-rich blood when you exercise.\nKeep in mind the following:\nTalk to a provider if your pulse rate is routinely less than 60 beats per minute or more than 100 beats per minute.Each beat should be equally spaced out.Beats shouldn’t be excessively strong. This could indicate that your heart is working hard.Your heart shouldn’t skip a beat.\nTalk to a provider if your pulse rate is routinely less than 60 beats per minute or more than 100 beats per minute.\nEach beat should be equally spaced out.\nBeats shouldn’t be excessively strong. This could indicate that your heart is working hard.\nYour heart shouldn’t skip a beat.\nYou can measure your pulse by firmly, but gently, pressing your first and second fingertips against certain points on the body — most commonly at your wrist or neck. Use your watch and count the number of heartbeats you have in 60 seconds. The result is your pulse or heart rate.\nAdvertisement\nFactors that can affect your pulse include:\nExercise.Stress.Strong emotions.Caffeine.\nExercise.\nStress.\nStrong emotions.\nCaffeine.\nHealth conditions that can affect your pulse may include, but aren’t limited to, the following:\nAn infection.Dehydration.Stress.Anxiety.Thyroid conditions.Anemia.Shock.Arrhythmia.\nAn infection.\nDehydration.\nStress.\nAnxiety.\nThyroid conditions.\nAnemia.\nShock.\nArrhythmia.\nSome medications, especially beta-blockers and digoxin, can slow your pulse."
    },
    {
      "heading": "What is a respiratory rate?",
      "content": "Your respiratory rate, or your breathing rate, is the number of breaths you take per minute. The normal respiratory rate for an adult at rest is 12 to 18 breaths per minute. A respiration rate under 12 or over 25 breaths per minute while resting may be a sign of an underlying health condition.\nYou can check your respiratory rate by:\nFinding a quiet location to sit down and relax.Use your watch and count how many breaths you take in 60 seconds.\nFinding a quiet location to sit down and relax.\nUse your watch and count how many breaths you take in 60 seconds.\nIt can be difficult to count your own breaths, especially if you’re nervous or anxious. You can ask a friend or family member to help you check your respiratory rate. They’ll be able to see your chest rising and falling with each breath to get an accurate measurement.\nHealth conditions that can affect your respiratory rate include, but aren’t limited to, the following:\nAsthma.Anxiety.Pneumonia.Heart disease.Lung disease.Substance use disorder.\nAsthma.\nAnxiety.\nPneumonia.\nHeart disease.\nLung disease.\nSubstance use disorder.\nA note from Cleveland Clinic\nVital signs are important indicators of your overall health. Checking your vitals is the first step toward finding out what’s going on in your body. Vital signs let your care team know if you’re having a medical emergency or if there’s an underlying medical condition affecting your well-being. A healthcare provider will let you know if you need to check your vital signs at home regularly. Children usually don’t need their vitals checked outside of pediatric appointments. If your vital signs are abnormal or you have a question about how to take your vital signs, talk with a healthcare provider.\nLast reviewed on 03/15/2023.\nLearn more about the Health Library and our editorial process."
    }
  ]
}