{
  "source_url": "https://my.clevelandclinic.org/health/drugs/20966-metformin-tablets",
  "chunks": [
    {
      "heading": "What is this medication?",
      "content": "METFORMIN (met FOR min) treats type 2 diabetes. It controls blood sugar (glucose) and helps your body use insulin effectively. This medication is often combined with changes to diet and exercise.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nThis medicine may be used for other purposes; ask your health care provider or pharmacist if you have questions.\nCOMMON BRAND NAME(S): Glucophage"
    },
    {
      "heading": "What should I tell my care team before I take this medication?",
      "content": "They need to know if you have any of these conditions:\nAnemiaDehydrationHeart diseaseIf you often drink alcoholKidney diseaseLiver diseasePolycystic ovary syndromeSerious infection or injuryVomitingAn unusual or allergic reaction to metformin, other medications, foods, dyes, or preservativesPregnant or trying to get pregnantBreast-feeding\nAnemia\nDehydration\nHeart disease\nIf you often drink alcohol\nKidney disease\nLiver disease\nPolycystic ovary syndrome\nSerious infection or injury\nVomiting\nAn unusual or allergic reaction to metformin, other medications, foods, dyes, or preservatives\nPregnant or trying to get pregnant\nBreast-feeding"
    },
    {
      "heading": "How should I use this medication?",
      "content": "Take this medication by mouth with a glass of water. Follow the directions on the prescription label. Take this medication with food. Take your medication at regular intervals. Do not take your medication more often than directed. Do not stop taking except on your care team's advice.\nTalk to your care team about the use of this medication in children. While this medication may be prescribed for children as young as 10 years of age for selected conditions, precautions do apply.\nOverdosage: If you think you have taken too much of this medicine contact a poison control center or emergency room at once.\nNOTE: This medicine is only for you. Do not share this medicine with others."
    },
    {
      "heading": "What if I miss a dose?",
      "content": "If you miss a dose, take it as soon as you can. If it is almost time for your next dose, take only that dose. Do not take double or extra doses.\nAdvertisement"
    },
    {
      "heading": "What may interact with this medication?",
      "content": "Do not take this medication with any of the following:\nCertain contrast medications given before X-rays, CT scans, MRI, or other proceduresDofetilide\nCertain contrast medications given before X-rays, CT scans, MRI, or other procedures\nDofetilide\nThis medication may also interact with the following:\nAcetazolamideAlcoholCertain antivirals for HIV or hepatitisCertain medications for blood pressure, heart disease, irregular heart beatCimetidineDichlorphenamideDigoxinDiureticsEstrogens, progestins, or birth control pillsGlycopyrrolateIsoniazidLamotrigineMemantineMethazolamideMetoclopramideMidodrineNiacinPhenothiazines like chlorpromazine, mesoridazine, prochlorperazine, thioridazinePhenytoinRanolazineSteroid medications like prednisone or cortisoneStimulant medications for attention disorders, weight loss, or to stay awakeThyroid medicationsTopiramateTrospiumVandetanibZonisamide\nAcetazolamide\nAlcohol\nCertain antivirals for HIV or hepatitis\nCertain medications for blood pressure, heart disease, irregular heart beat\nCimetidine\nDichlorphenamide\nDigoxin\nDiuretics\nEstrogens, progestins, or birth control pills\nGlycopyrrolate\nIsoniazid\nLamotrigine\nMemantine\nMethazolamide\nMetoclopramide\nMidodrine\nNiacin\nPhenothiazines like chlorpromazine, mesoridazine, prochlorperazine, thioridazine\nPhenytoin\nRanolazine\nSteroid medications like prednisone or cortisone\nStimulant medications for attention disorders, weight loss, or to stay awake\nThyroid medications\nTopiramate\nTrospium\nVandetanib\nZonisamide\nThis list may not describe all possible interactions. Give your health care provider a list of all the medicines, herbs, non-prescription drugs, or dietary supplements you use. Also tell them if you smoke, drink alcohol, or use illegal drugs. Some items may interact with your medicine."
    },
    {
      "heading": "What should I watch for while using this medication?",
      "content": "Visit your care team for regular checks on your progress.\nA test called the HbA1C (A1C) will be monitored. This is a simple blood test. It measures your blood sugar control over the last 2 to 3 months. You will receive this test every 3 to 6 months.\nUsing this medication with insulin or a sulfonylurea may increase your risk of hypoglycemia. Learn how to check your blood sugar. Learn the symptoms of low and high blood sugar and how to manage them.\nAlways carry a quick-source of sugar with you in case you have symptoms of low blood sugar. Examples include hard sugar candy or glucose tablets. Make sure others know that you can choke if you eat or drink when you develop serious symptoms of low blood sugar, such as seizures or unconsciousness. They must get medical help at once.\nTell your care team if you have high blood sugar. You might need to change the dose of your medication. If you are sick or exercising more than usual, you might need to change the dose of your medication.\nDo not skip meals. Ask your care team if you should avoid alcohol. Many nonprescription cough and cold products contain sugar or alcohol. These can affect blood sugar.\nThis medication may cause ovulation in premenopausal women who do not have regular monthly periods. This may increase your chances of becoming pregnant. You should not take this medication if you become pregnant or think you may be pregnant. Talk with your care team about your birth control options while taking this medication. Contact your care team right away if you think you are pregnant.\nAdvertisement\nIf you are going to need surgery, an MRI, CT scan, or other procedure, tell your care team that you are taking this medication. You may need to stop taking this medication before the procedure.\nWear a medical ID bracelet or chain, and carry a card that describes your disease and details of your medication and dosage times.\nThis medication may cause a decrease in folic acid and vitamin B12. You should make sure that you get enough vitamins while you are taking this medication. Discuss the foods you eat and the vitamins you take with your care team."
    },
    {
      "heading": "What side effects may I notice from receiving this medication?",
      "content": "Side effects that you should report to your care team as soon as possible:\nAllergic reactions—skin rash, itching, hives, swelling of the face, lips, tongue, or throatHigh lactic acid level—muscle pain or cramps, stomach pain, trouble breathing, general discomfort or fatigueLow vitamin B12 level—pain, tingling, or numbness in the hands or feet, muscle weakness, dizziness, confusion, difficulty concentrating\nAllergic reactions—skin rash, itching, hives, swelling of the face, lips, tongue, or throat\nHigh lactic acid level—muscle pain or cramps, stomach pain, trouble breathing, general discomfort or fatigue\nLow vitamin B12 level—pain, tingling, or numbness in the hands or feet, muscle weakness, dizziness, confusion, difficulty concentrating\nSide effects that usually do not require medical attention (report to your care team if they continue or are bothersome):\nDiarrheaGasHeadacheMetallic taste in mouthNausea\nDiarrhea\nGas\nHeadache\nMetallic taste in mouth\nNausea\nThis list may not describe all possible side effects. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088.\nAdvertisement"
    },
    {
      "heading": "Where should I keep my medication?",
      "content": "Keep out of the reach of children and pets.\nStore at room temperature between 15 and 30 degrees C (59 and 86 degrees F). Protect from moisture and light. Get rid of any unused medication after the expiration date.\nTo get rid of medications that are no longer needed or expired:\nTake the medication to a medication take-back program. Check with your pharmacy or law enforcement to find a location.If you cannot return the medication, check the label or package insert to see if the medication should be thrown out in the garbage or flushed down the toilet. If you are not sure, ask your care team. If it is safe to put in the trash, empty the medication out of the container. Mix the medication with cat litter, dirt, coffee grounds, or other unwanted substance. Seal the mixture in a bag or container. Put it in the trash.\nTake the medication to a medication take-back program. Check with your pharmacy or law enforcement to find a location.\nIf you cannot return the medication, check the label or package insert to see if the medication should be thrown out in the garbage or flushed down the toilet. If you are not sure, ask your care team. If it is safe to put in the trash, empty the medication out of the container. Mix the medication with cat litter, dirt, coffee grounds, or other unwanted substance. Seal the mixture in a bag or container. Put it in the trash.\nNOTE: This sheet is a summary. It may not cover all possible information. If you have questions about this medicine, talk to your doctor, pharmacist, or health care provider.\nAdvertisement\nCopyright ©2024 Elsevier Inc. All Rights Reserved.\nTerms of use.\nNote: Introduction and Additional Common Questions written and medically approved by Cleveland Clinic professionals."
    }
  ]
}