{
  "source_url": "https://my.clevelandclinic.org/health/procedures/21922-appendectomy",
  "chunks": [
    {
      "heading": "What is an appendectomy?",
      "content": "Appendectomy is surgery to remove an inflamed or infected appendix (appendicitis). Your appendix is a small, tube-like organ that extends from your colon on the lower-right side of your belly.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nBecause an inflamed appendix has the potential to rupture (burst), appendicitis is a medical emergency. On the other hand, a healthy appendix doesn’t appear to have any essential function. If you must have your appendix removed, you won’t miss it.\nBecause it’s so small, your appendix swells quickly with inflammation and doesn’t take much to burst. A burst appendix can spread infection throughout your abdominal cavity, leading to peritonitis (inflammation in your abdominal lining). If the infection spreads to your bloodstream, it can lead to sepsis, a serious, life-threatening condition. Your appendix can rupture within 36 hours of your first symptoms, so when you seek treatment, time is of the essence.\nIn most cases, appendectomy is the safest treatment for appendicitis in children and adults. There are a few exceptions — for example, some people might not qualify for surgery. Some might only need antibiotics if they have mild appendicitis, or if they catch it early enough. Even so, these people have a higher risk of recurrent (returning) infection. Ultimately, the risk of rupture is much greater than the low risk of surgery. It’s safest to remove your inflamed appendix if it’s at risk of rupturing.\nAdvertisement\nAppendix removal has been the standard treatment for appendicitis for over 100 years. In the United States, surgeons do about 300,000 appendectomies each year."
    },
    {
      "heading": "What happens before appendix removal?",
      "content": "Most appendectomies occur within 24 hours of your appendicitis diagnosis. Prior to your surgery, your healthcare team will place an IV line into a vein so they can give you antibiotics as soon as possible. They’ll continue antibiotic therapy until sometime after the surgery — usually one to seven days — depending on the severity of the infection. Your provider will check your response to the antibiotics to make sure you need surgery before proceeding.\nYour healthcare provider may also need to run additional tests before your surgery, like blood tests or imaging scans. These tests can give them more information about the nature of your appendicitis. They’ll also need to review your medical history, including any current medications, allergies or conditions. Based on these and other factors, they’ll explain the type of surgery they want to perform and ask for your consent.\nYou’ll have to avoid eating and drinking for eight hours before the surgery, but you’ll receive fluids through your IV line."
    },
    {
      "heading": "What happens during an appendectomy?",
      "content": "An anesthesiologist will give you general anesthesia so you can sleep through your surgery. Your team will also place a tube through your mouth and into your throat. This keeps your airway open and allows your team to monitor your breathing during the procedure.\nThe exact surgical steps vary depending on what type of appendectomy you need: laparoscopic or open.\nFor a laparoscopic appendectomy, your surgeon will:\nMake one to three small incisions near your belly button.Insert a tiny port into one of the incisions.Place a small tube (cannula) through the port.Use the cannula to inflate your belly with carbon dioxide gas. (This makes more room for the operation and allows for clearer views with the laparoscope — a long, thin tube with a tiny light and a high-resolution camera attached.)Remove the cannula and insert a laparoscope. The camera will display the surgery on a video screen, allowing your surgeon to locate your appendix and guide the instruments through the incisions.Tie off your appendix with sutures, detach it from your colon and remove it from your body.Close your incisions.\nMake one to three small incisions near your belly button.\nInsert a tiny port into one of the incisions.\nPlace a small tube (cannula) through the port.\nUse the cannula to inflate your belly with carbon dioxide gas. (This makes more room for the operation and allows for clearer views with the laparoscope — a long, thin tube with a tiny light and a high-resolution camera attached.)\nRemove the cannula and insert a laparoscope. The camera will display the surgery on a video screen, allowing your surgeon to locate your appendix and guide the instruments through the incisions.\nTie off your appendix with sutures, detach it from your colon and remove it from your body.\nClose your incisions.\nWith a laparoscopic approach, you’ll have three small incisions between your belly button and your pubic hairline.\nIn some cases, your surgeon may need to “switch gears” from laparoscopic appendectomy to open appendectomy. This can happen if you have widespread infection in your abdominal cavity.\nFor an open appendectomy, your surgeon will:\nMake one larger incision in your lower right abdomen.Open your abdominal cavity to locate your appendix.Drain any infection from your abdominal cavity.Rinse your abdominal cavity with a sterile saline solution.Tie off your appendix with sutures, detach it from your colon and remove it from your body.Reposition your abdominal tissue.Close your incision with sutures.\nMake one larger incision in your lower right abdomen.\nOpen your abdominal cavity to locate your appendix.\nDrain any infection from your abdominal cavity.\nRinse your abdominal cavity with a sterile saline solution.\nTie off your appendix with sutures, detach it from your colon and remove it from your body.\nReposition your abdominal tissue.\nClose your incision with sutures.\nAdvertisement\nIf you have peritonitis, your surgeon may leave a drainage tube in your belly and remove it later.\nWith an open approach, your appendectomy scar will be about 3 inches (7.63 centimeters) long, on the lower-right side of your abdomen."
    },
    {
      "heading": "How long does an appendectomy take?",
      "content": "On average, appendix removal takes about one hour to complete. It could take more or less time depending on your situation."
    },
    {
      "heading": "What happens after appendix removal?",
      "content": "If you had a laparoscopic appendectomy with no complications, you might go home the same day. You’ll need someone else to drive you home, though, since the anesthesia will still be wearing off.\nIf you had a ruptured appendix or open surgery, you might be in the hospital for a few more days. Your healthcare provider will continue to give you IV antibiotics and monitor your condition. If you still have your draining tube, your provider will remove it before you go home."
    },
    {
      "heading": "How successful is an appendectomy?",
      "content": "Appendectomy is the definitive treatment for appendicitis, with a success rate of over 95%."
    },
    {
      "heading": "What are the risks or complications of appendectomy surgery?",
      "content": "Complications are rare but possible. They include:\nBleeding.Wound infection.Blocked bowels.Injury to nearby organs.\nBleeding.\nWound infection.\nBlocked bowels.\nInjury to nearby organs.\nYou might experience some side effects of the surgery over the next few days. Common side effects include:\nNausea.Constipation.Gas pain.Abdominal bloating.\nNausea.\nConstipation.\nGas pain.\nAbdominal bloating."
    },
    {
      "heading": "How long does it take to recover from an appendectomy?",
      "content": "Recuperation after appendectomy can vary depending on how inflamed your appendix was, whether there were complications and how your body responds to the surgery.\nAdvertisement\nMost of your side effects should lessen in a few days. But it may take a few weeks to return to your normal activities. Most people can return to work or school in one to three weeks — up to a month if they have an open appendectomy. Full recovery takes about six weeks.\nHere are some guidelines to follow during your appendectomy recovery:\nDo:\nKeep your incision(s) clean and dry to prevent infection.Eat soft foods until your bowels can tolerate more solid foods. Take it slow.Limit your physical activity. If you had open surgery, your abdominal muscles may ache after standing too long.Call your healthcare provider if you notice any symptoms like fever or pus around your incision(s).\nKeep your incision(s) clean and dry to prevent infection.\nEat soft foods until your bowels can tolerate more solid foods. Take it slow.\nLimit your physical activity. If you had open surgery, your abdominal muscles may ache after standing too long.\nCall your healthcare provider if you notice any symptoms like fever or pus around your incision(s).\nDon’t:\nTake medication that your provider hasn’t approved. Some pain medications may cause you to bleed more easily.Bathe (unless your provider clears you). Don’t go swimming until your stitches dissolve (or until your provider removes them).Strain your abdominal muscles. Avoid stair climbing and lifting heavy objects.Be totally still. It’s important to get up and walk around now and then to prevent blood clots and help your bowels return to normal.\nTake medication that your provider hasn’t approved. Some pain medications may cause you to bleed more easily.\nBathe (unless your provider clears you). Don’t go swimming until your stitches dissolve (or until your provider removes them).\nStrain your abdominal muscles. Avoid stair climbing and lifting heavy objects.\nBe totally still. It’s important to get up and walk around now and then to prevent blood clots and help your bowels return to normal."
    },
    {
      "heading": "When should I call my healthcare provider?",
      "content": "In general, you should schedule a follow-up appointment with your healthcare provider within two or three weeks of your appendectomy. But you should call them right away if you notice signs of infection like:\nAdvertisement\nDiscoloration or swelling at your incision site(s).Fever.Stomach cramps.Loss of appetite.\nDiscoloration or swelling at your incision site(s).\nFever.\nStomach cramps.\nLoss of appetite."
    },
    {
      "heading": "Is appendectomy a major surgery?",
      "content": "Not necessarily. In the U.S. today, laparoscopic appendectomy is more common than the traditional open appendectomy. Laparoscopic surgery is a less invasive alternative. It uses several micro-incisions instead of one larger incision. People who have laparoscopic appendectomy typically recover faster and have less post-operative pain. The type of appendectomy that’s right for you depends on your condition as well as the training and judgment of your surgeon."
    },
    {
      "heading": "Is appendectomy painful?",
      "content": "You won’t feel anything during the surgery because you’ll be under general anesthesia. Afterward, it’s normal to experience some degree of discomfort. This should improve within a few days. Your healthcare provider will give you medications to ease pain and swelling."
    },
    {
      "heading": "Can you live a normal life after appendix removal?",
      "content": "Yes, your body will work just fine without your appendix. You’ll be able to eat the same things and enjoy the same activities you always have."
    },
    {
      "heading": "A note from Cleveland Clinic",
      "content": "No one wants to have abdominal surgery. But if you develop appendicitis, you’ll need swift relief. Appendectomy is still the safest, most effective way to treat appendicitis and prevent the spread of infection — which can be catastrophic. Laparoscopic surgery allows for a minimally invasive outpatient procedure when circumstances allow. We hope you don’t have to have an appendectomy. But if you do, you’ll be in good company among the hundreds of thousands each year who undergo the surgery.\nLast reviewed on 06/11/2024.\nLearn more about the Health Library and our editorial process."
    }
  ]
}