{
  "source_url": "https://my.clevelandclinic.org/health/drugs/18057-furosemide-tablets",
  "chunks": [
    {
      "heading": "What is this medication?",
      "content": "FUROSEMIDE (fyoor OH se mide) treats high blood pressure. It may also be used to reduce swelling related to heart, kidney, or liver disease. It helps your kidneys remove more fluid and salt from your blood through the urine. It belongs to a group of medications called diuretics.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nThis medicine may be used for other purposes; ask your health care provider or pharmacist if you have questions.\nCOMMON BRAND NAME(S): Active-Medicated Specimen Kit, Delone, Diuscreen, Lasix, RX Specimen Collection Kit, Specimen Collection Kit, URINX Medicated Specimen Collection"
    },
    {
      "heading": "What should I tell my care team before I take this medication?",
      "content": "They need to know if you have any of these conditions:\nDiarrhea or vomitingGoutHeart diseaseHigh or low levels of electrolytes, such as magnesium, potassium, or sodium in your bloodKidney disease, small amounts of urine, or difficulty passing urineLiver diseaseThyroid diseaseAn unusual or allergic reaction to furosemide, sulfa medications, other medications, foods, dyes, or preservativesPregnant or trying to get pregnantBreast-feeding\nDiarrhea or vomiting\nGout\nHeart disease\nHigh or low levels of electrolytes, such as magnesium, potassium, or sodium in your blood\nKidney disease, small amounts of urine, or difficulty passing urine\nLiver disease\nThyroid disease\nAn unusual or allergic reaction to furosemide, sulfa medications, other medications, foods, dyes, or preservatives\nPregnant or trying to get pregnant\nBreast-feeding"
    },
    {
      "heading": "How should I use this medication?",
      "content": "Take this medication by mouth. Take it as directed on the prescription label at the same time every day. You can take it with or without food. If it upsets your stomach, take it with food. Keep taking it unless your care team tells you to stop.\nTalk to your care team about the use of this medication in children. Special care may be needed.\nOverdosage: If you think you have taken too much of this medicine contact a poison control center or emergency room at once.\nNOTE: This medicine is only for you. Do not share this medicine with others.\nAdvertisement"
    },
    {
      "heading": "What if I miss a dose?",
      "content": "If you miss a dose, take it as soon as you can. If it is almost time for your next dose, take only that dose. Do not take double or extra doses."
    },
    {
      "heading": "What may interact with this medication?",
      "content": "Aspirin and aspirin-like medicationsCertain antibioticsChloral hydrateCisplatinCyclosporineDigoxinDiureticsLaxativesLithiumMedications for blood pressureMedications that relax muscles for surgeryMethotrexateNSAIDs, medications for pain and inflammation, such as ibuprofen, naproxen, or indomethacinPhenytoinSteroid medications, such as prednisone or cortisoneSucralfateThyroid hormones\nAspirin and aspirin-like medications\nCertain antibiotics\nChloral hydrate\nCisplatin\nCyclosporine\nDigoxin\nDiuretics\nLaxatives\nLithium\nMedications for blood pressure\nMedications that relax muscles for surgery\nMethotrexate\nNSAIDs, medications for pain and inflammation, such as ibuprofen, naproxen, or indomethacin\nPhenytoin\nSteroid medications, such as prednisone or cortisone\nSucralfate\nThyroid hormones\nThis list may not describe all possible interactions. Give your health care provider a list of all the medicines, herbs, non-prescription drugs, or dietary supplements you use. Also tell them if you smoke, drink alcohol, or use illegal drugs. Some items may interact with your medicine."
    },
    {
      "heading": "What should I watch for while using this medication?",
      "content": "Visit your care team for regular checks on your progress. Tell your care team if your symptoms do not start to get better or if they get worse. Check your blood pressure as directed. Know what your blood pressure should be and when to contact your care team.\nThis medication may increase the amount of sugar in blood or urine. The risk may be higher in patients who already have diabetes. Ask your care team what you can do to lower your risk of diabetes while taking this medication.\nYou may need to be on a special diet while taking this medication. Check with your care team. Also, ask how many glasses of fluid you need to drink a day. You must not get dehydrated.\nThis medication may affect your coordination, reaction time, or judgment. Do not drive or operate machinery until you know how this medication affects you. Sit up or stand slowly to reduce the risk of dizzy or fainting spells. Drinking alcohol with this medication can increase the risk of these side effects.\nThis medication can make you more sensitive to the sun. Keep out of the sun. If you cannot avoid being in the sun, wear protective clothing and use sunscreen. Do not use sun lamps or tanning beds/booths.\nCheck with your care team if you have severe diarrhea, nausea, and vomiting, or if you sweat a lot. The loss of too much body fluid may make it dangerous for you to take this medication."
    },
    {
      "heading": "What side effects may I notice from receiving this medication?",
      "content": "Side effects that you should report to your care team as soon as possible:\nAllergic reactions—skin rash, itching, hives, swelling of the face, lips, tongue, or throatDehydration—increased thirst, dry mouth, feeling faint or lightheaded, headache, dark yellow or brown urineHearing loss, ringing in earsHigh blood sugar (hyperglycemia)—increased thirst or amount of urine, unusual weakness or fatigue, blurry visionLow blood pressure—dizziness, feeling faint or lightheaded, blurry visionLow potassium level—muscle pain or cramps, unusual weakness or fatigue, fast or irregular heartbeat, constipation\nAllergic reactions—skin rash, itching, hives, swelling of the face, lips, tongue, or throat\nDehydration—increased thirst, dry mouth, feeling faint or lightheaded, headache, dark yellow or brown urine\nHearing loss, ringing in ears\nHigh blood sugar (hyperglycemia)—increased thirst or amount of urine, unusual weakness or fatigue, blurry vision\nLow blood pressure—dizziness, feeling faint or lightheaded, blurry vision\nLow potassium level—muscle pain or cramps, unusual weakness or fatigue, fast or irregular heartbeat, constipation\nAdvertisement\nSide effects that usually do not require medical attention (report to your care team if they continue or are bothersome):\nBurning or tingling sensation in hands or feetConstipationDiarrheaDizzinessHeadache\nBurning or tingling sensation in hands or feet\nConstipation\nDiarrhea\nDizziness\nHeadache\nThis list may not describe all possible side effects. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088."
    },
    {
      "heading": "Where should I keep my medication?",
      "content": "Keep out of the reach of children and pets.\nStore at room temperature between 20 and 25 degrees C (68 and 77 degrees F). Protect from light and moisture. Keep the container tightly closed. Throw away any unused medication after the expiration date.\nNOTE: This sheet is a summary. It may not cover all possible information. If you have questions about this medicine, talk to your doctor, pharmacist, or health care provider.\nAdvertisement\nCopyright ©2024 Elsevier Inc. All Rights Reserved.\nTerms of use.\nNote: Introduction and Additional Common Questions written and medically approved by Cleveland Clinic professionals."
    }
  ]
}