{
  "source_url": "https://my.clevelandclinic.org/health/drugs/20592-aspirin-tablets",
  "chunks": [
    {
      "heading": "What is this medication?",
      "content": "ASPIRIN (AS pir in) lowers the risk of heart attack, stroke, or blood clot. It may also be used to treat mild to moderate pain, inflammation, or arthritis. It belongs to a group of medications called NSAIDs.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nThis medicine may be used for other purposes; ask your health care provider or pharmacist if you have questions.\nCOMMON BRAND NAME(S): Aspir-Low, Aspir-Trin, Aspirtab, Bayer Advanced Aspirin, Bayer Aspirin, Bayer Aspirin Extra Strength, Bayer Aspirin Plus, Bayer Extra Strength, Bayer Extra Strength Plus, Bayer Genuine Aspirin, Bayer Womens Aspirin, Bufferin, Bufferin Extra Strength, Bufferin Low Dose"
    },
    {
      "heading": "What should I tell my care team before I take this medication?",
      "content": "They need to know if you have any of these conditions:\nAnemiaAsthmaBleeding problemsDiabetesGoutHistory of stomach ulcers or bleedingIf you often drink alcoholKidney diseaseLiver diseaseLow level of vitamin KLupusSmoke tobaccoAn unusual or allergic reaction to aspirin, tartrazine dye, other medications, dyes, or preservativesPregnant or trying to get pregnantBreast-feeding\nAnemia\nAsthma\nBleeding problems\nDiabetes\nGout\nHistory of stomach ulcers or bleeding\nIf you often drink alcohol\nKidney disease\nLiver disease\nLow level of vitamin K\nLupus\nSmoke tobacco\nAn unusual or allergic reaction to aspirin, tartrazine dye, other medications, dyes, or preservatives\nPregnant or trying to get pregnant\nBreast-feeding"
    },
    {
      "heading": "How should I use this medication?",
      "content": "Take this medication by mouth with a glass of water. Follow the directions on the package or prescription label. You can take this medication with or without food. If it upsets your stomach, take it with food. Do not take it more often than directed.\nTalk to your care team about the use of this medication in children. While this medication may be prescribed for children as young as 12 years of age for selected conditions, precautions do apply. Children and teenagers should not use this medication to treat chicken pox or flu symptoms unless directed by a care team.\nAdvertisement\nPatients over 65 years old may have a stronger reaction and need a smaller dose.\nOverdosage: If you think you have taken too much of this medicine contact a poison control center or emergency room at once.\nNOTE: This medicine is only for you. Do not share this medicine with others."
    },
    {
      "heading": "What if I miss a dose?",
      "content": "If you are taking this medication on a regular schedule and miss a dose, take it as soon as you can. If it is almost time for your next dose, take only that dose. Do not take double or extra doses."
    },
    {
      "heading": "What may interact with this medication?",
      "content": "Do not take this medication with any of the following:\nCidofovirKetorolacProbenecid\nCidofovir\nKetorolac\nProbenecid\nThis medication may also interact with the following:\nAlcoholAlendronateBismuth subsalicylateFlavocoxidHerbal supplements like feverfew, garlic, ginger, ginkgo biloba, horse chestnutMedications for diabetes or glaucoma like acetazolamide, methazolamideMedications for goutMedications that prevent or treat blood clots like apixaban, clopidogrel, enoxaparin, heparin, rivaroxaban, warfarinOther aspirin and aspirin-like medicationsNSAIDs, medications for pain and inflammation, like ibuprofen or naproxenPemetrexedSulfinpyrazoneVaricella live vaccine\nAlcohol\nAlendronate\nBismuth subsalicylate\nFlavocoxid\nHerbal supplements like feverfew, garlic, ginger, ginkgo biloba, horse chestnut\nMedications for diabetes or glaucoma like acetazolamide, methazolamide\nMedications for gout\nMedications that prevent or treat blood clots like apixaban, clopidogrel, enoxaparin, heparin, rivaroxaban, warfarin\nOther aspirin and aspirin-like medications\nNSAIDs, medications for pain and inflammation, like ibuprofen or naproxen\nPemetrexed\nSulfinpyrazone\nVaricella live vaccine\nThis list may not describe all possible interactions. Give your health care provider a list of all the medicines, herbs, non-prescription drugs, or dietary supplements you use. Also tell them if you smoke, drink alcohol, or use illegal drugs. Some items may interact with your medicine."
    },
    {
      "heading": "What should I watch for while using this medication?",
      "content": "If you are treating yourself for pain, tell your doctor or health care provider if the pain lasts more than 10 days, if it gets worse, or if there is a new or different kind of pain. Tell your doctor if you see redness or swelling. Also, check with your doctor if you have a fever that lasts for more than 3 days. Only take this medication to prevent heart attacks or blood clotting if prescribed by your doctor or health care provider.\nDo not take other medications that contain aspirin, ibuprofen, or naproxen with this medication. Side effects such as stomach upset, nausea, or ulcers may be more likely to occur. Many non-prescription medications contain aspirin, ibuprofen, or naproxen. Always read labels carefully.\nThis medication can cause serious ulcers and bleeding in the stomach. It can happen with no warning. Smoking, drinking alcohol, older age, and poor health can also increase risks. Call your health care provider right away if you have stomach pain or blood in your vomit or stool.\nAlcohol may interfere with the effect of this medication. Avoid alcoholic drinks.\nThis medication may cause serious skin reactions. They can happen weeks to months after starting the medication. Contact your health care provider right away if you notice fevers or flu-like symptoms with a rash. The rash may be red or purple and then turn into blisters or peeling of the skin. Or, you might notice a red rash with swelling of the face, lips or lymph nodes in your neck or under your arms.\nAdvertisement\nTalk to your health care provider if you are pregnant before taking this medication. Taking this medication between weeks 20 and 30 of pregnancy may harm your unborn baby. Your health care provider will monitor you closely if you need to take it. After 30 weeks of pregnancy, do not take this medication.\nBe careful brushing or flossing your teeth or using a toothpick because you may get an infection or bleed more easily. If you have any dental work done, tell your dentist you are receiving this medication.\nThis medication may make it more difficult to get pregnant. Talk to your health care provider if you are concerned about your fertility."
    },
    {
      "heading": "What side effects may I notice from receiving this medication?",
      "content": "Side effects that you should report to your care team as soon as possible:\nAllergic reactions—skin rash, itching, hives, swelling of the face, lips, tongue, or throatBleeding—bloody or black, tar-like stools, vomiting blood or brown material that looks like coffee grounds, red or dark brown urine, red or purple spots on skin, unusual bruising or bleedingHearing loss, ringing in earsKidney injury—decrease in the amount of urine, swelling of the ankles, hands, or feetLiver injury—right upper belly pain, loss of appetite, nausea, light-colored stool, dark yellow or brown urine, yellowing of the skin or eyes, unusual weakness, fatigueRash, fever, and swollen lymph nodes\nAllergic reactions—skin rash, itching, hives, swelling of the face, lips, tongue, or throat\nBleeding—bloody or black, tar-like stools, vomiting blood or brown material that looks like coffee grounds, red or dark brown urine, red or purple spots on skin, unusual bruising or bleeding\nHearing loss, ringing in ears\nKidney injury—decrease in the amount of urine, swelling of the ankles, hands, or feet\nLiver injury—right upper belly pain, loss of appetite, nausea, light-colored stool, dark yellow or brown urine, yellowing of the skin or eyes, unusual weakness, fatigue\nRash, fever, and swollen lymph nodes\nAdvertisement\nSide effects that usually do not require medical attention (report to your care team if they continue or are bothersome):\nHeadacheLoss of appetiteNauseaUpset stomach\nHeadache\nLoss of appetite\nNausea\nUpset stomach\nThis list may not describe all possible side effects. Call your doctor for medical advice about side effects. You may report side effects to FDA at 1-800-FDA-1088."
    },
    {
      "heading": "Where should I keep my medication?",
      "content": "Keep out of the reach of children and pets.\nStore at room temperature between 15 and 30 degrees C (59 and 86 degrees F). Protect from heat and moisture. Get rid of any unused medication after the expiration date.\nDo not use this medication if it has a strong vinegar smell.\nTo get rid of medications that are no longer needed or have expired:\nTake the medication to a medication take-back program. Check with your pharmacy or law enforcement to find a location.If you cannot return the medication, check the label or package insert to see if the medication should be thrown out in the garbage or flushed down the toilet. If you are not sure, ask your care team. If it is safe to put it in the trash, empty the medication out of the container. Mix the medication with cat litter, dirt, coffee grounds, or other unwanted substance. Seal the mixture in a bag or container. Put it in the trash.\nTake the medication to a medication take-back program. Check with your pharmacy or law enforcement to find a location.\nIf you cannot return the medication, check the label or package insert to see if the medication should be thrown out in the garbage or flushed down the toilet. If you are not sure, ask your care team. If it is safe to put it in the trash, empty the medication out of the container. Mix the medication with cat litter, dirt, coffee grounds, or other unwanted substance. Seal the mixture in a bag or container. Put it in the trash.\nAdvertisement\nNOTE: This sheet is a summary. It may not cover all possible information. If you have questions about this medicine, talk to your doctor, pharmacist, or health care provider.\nCopyright ©2024 Elsevier Inc. All Rights Reserved.\nTerms of use.\nNote: Introduction and Additional Common Questions written and medically approved by Cleveland Clinic professionals."
    }
  ]
}