{
  "source_url": "https://my.clevelandclinic.org/health/procedures/21614-gallbladder-removal",
  "chunks": [
    {
      "heading": "What is a cholecystectomy?",
      "content": "A cholecystectomy is a surgical procedure to remove your gallbladder — the small, hollow organ that stores bile for your digestive system. Gallbladder removal surgery is a common treatment for many types of gallbladder disease. This is because the downsides of having your gallbladder removed are generally fewer than those of the diseases it treats. You can live a healthy life without a gallbladder.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy"
    },
    {
      "heading": "Is cholecystectomy a major surgery?",
      "content": "Cholecystectomy is a common procedure with a typically easy recovery. It’s also one of the first procedures that’s become routinely performed using minimally invasive surgery techniques. These techniques, including laparoscopic surgery and robotic surgery, use very small incisions of a half-inch or less to minimize trauma, pain and recovery time. While an open operation with a larger incision may occasionally be necessary, laparoscopic cholecystectomy is far more common today than open surgery."
    },
    {
      "heading": "Why is cholecystectomy done?",
      "content": "You might need gallbladder removal surgery if gallbladder disease:\nInterferes with your quality of life.Poses significant risks to your health.Is expected to continue and/or get worse.\nInterferes with your quality of life.\nPoses significant risks to your health.\nIs expected to continue and/or get worse.\nUnfortunately, this is the case with most of the conditions that can affect your gallbladder, including:\nGallstone disease.Chronic cholecystitis.Gallbladder cancer.\nGallstone disease.\nChronic cholecystitis.\nGallbladder cancer.\nGallstones are the most common reason for cholecystectomy. While many people live with gallstones and never have problems with them, those who do have problems tend to have them repeatedly. A gallstone that gets stuck anywhere in your biliary tract can block the flow of bile, causing pain and illness. It might block the opening to your gallbladder, your common bile duct or your pancreatic duct.\nAdvertisement"
    },
    {
      "heading": "How do I know if I need to have my gallbladder removed?",
      "content": "The most common and recognizable symptom of gallbladder disease is biliary colic. It’s a pattern of pain in your biliary tract (generally in your upper right abdomen) that occurs in episodes, often with nausea. Biliary colic is usually an early sign of biliary disease that’s likely to get worse. When your bile flow stalls completely, you’ll feel intense gallbladder pain that won’t go away until you get medical care.\nOther signs of possible gallbladder disease include:\nJaundice (a yellow tint to your skin and eyes).Swollen abdomen that’s tender to the touch.Large gallbladder polyps discovered on ultrasound.\nJaundice (a yellow tint to your skin and eyes).\nSwollen abdomen that’s tender to the touch.\nLarge gallbladder polyps discovered on ultrasound.\nIf you have any of these signs or symptoms, your healthcare provider will examine you and conduct the necessary tests to diagnose the cause. They’ll let you know if they recommend cholecystectomy for you."
    },
    {
      "heading": "How does gallbladder removal affect my body?",
      "content": "Gallbladder removal changes the structure of your biliary tract, which affects how your digestive system works. Your gallbladder usually stores extra bile until your small intestine needs it. It contracts to deliver the extra bile when you have a heavy meal to digest. After your cholecystectomy, bile will simply flow directly to your small intestine from your liver, where it’s made, without being stored first.\nMost people experience a temporary adjustment period in their digestive systems after gallbladder removal. For the first month or so, you might have more trouble digesting fats and heavier meals. This should gradually improve over time. Most people are able to resume a normal, healthy diet after their recovery. A small number of people develop longer-term digestive difficulties, for unclear reasons."
    },
    {
      "heading": "What are the different types of cholecystectomy procedures?",
      "content": "If you need to have your gallbladder removed, you could have a:\nLaparoscopic cholecystectomy.Robotic cholecystectomy.Open cholecystectomy.\nLaparoscopic cholecystectomy.\nRobotic cholecystectomy.\nOpen cholecystectomy.\nMore than 90% of cholecystectomy procedures in the U.S. today are laparoscopic. Surgeons prefer this method most of the time because it’s less invasive, causing less pain and bleeding and leading to a quicker and easier recovery. Robotic cholecystectomy is a variation of laparoscopic cholecystectomy that select hospitals might offer. In robotic surgery, your surgeon operates the robotic instruments from a console.\nAn open cholecystectomy is the traditional method for removing your gallbladder. It means that your surgeon opens up your abdomen by making one long incision to access your gallbladder. An open cholecystectomy is still a relatively simple and safe procedure, and in certain circumstances, it might be safer. Surgeons sometimes need open access to manage more urgent or complicated conditions.\nAdvertisement\nYou might have an open cholecystectomy instead of a laparoscopic cholecystectomy if:\nYou’re having your operation in a hospital that doesn’t have laparoscopic equipment.You’re having an emergency operation and time is of the essence.You have a cardiopulmonary condition that makes the gas used in laparoscopic surgery unsafe.You have extensive scarring from previous abdominal surgery that interferes with visibility.Your surgeon suspects that your disease affects other organs beyond your gallbladder.Unexpected complications arise during laparoscopic surgery, like uncontrolled bleeding.\nYou’re having your operation in a hospital that doesn’t have laparoscopic equipment.\nYou’re having an emergency operation and time is of the essence.\nYou have a cardiopulmonary condition that makes the gas used in laparoscopic surgery unsafe.\nYou have extensive scarring from previous abdominal surgery that interferes with visibility.\nYour surgeon suspects that your disease affects other organs beyond your gallbladder.\nUnexpected complications arise during laparoscopic surgery, like uncontrolled bleeding."
    },
    {
      "heading": "What happens before a cholecystectomy?",
      "content": "Cholecystectomy is often an elective procedure, meaning you’ll have it before it becomes urgently necessary. Your healthcare provider will explain the nature of your condition and why they recommend the procedure, and you’ll have time to think about it, choose when to have it and prepare. In other circumstances, cholecystectomy is an emergency procedure that occurs without a lot of lead time.\nYour healthcare team will:\nMake sure you’re in a fit condition for surgery. This might involve blood tests and other general health screenings. If you aren’t well enough for surgery, you might have an alternative procedure instead, like a cholecystostomy. You might have a cholecystectomy later on.Explain the procedure and why they want to do it. They’ll ask for your informed consent. They’ll let you know if they’re planning an open or laparoscopic cholecystectomy, although sometimes this plan changes. A laparoscopic procedure sometimes needs to convert to open surgery.Plan ahead, if possible. If they can schedule your surgery in advance, they’ll ask you to prepare by not smoking, not eating and not taking certain medications in the hours beforehand. These preparations help to prevent certain surgery complications and make surgery safer for you.Prepare you for surgery. When you’re ready for surgery, your team will install an IV line in your arm to deliver fluids and medications. You’ll have general anesthesia for the procedure. Once you’re unconscious, your team will install a breathing tube to help keep your airway open.\nMake sure you’re in a fit condition for surgery. This might involve blood tests and other general health screenings. If you aren’t well enough for surgery, you might have an alternative procedure instead, like a cholecystostomy. You might have a cholecystectomy later on.\nExplain the procedure and why they want to do it. They’ll ask for your informed consent. They’ll let you know if they’re planning an open or laparoscopic cholecystectomy, although sometimes this plan changes. A laparoscopic procedure sometimes needs to convert to open surgery.\nPlan ahead, if possible. If they can schedule your surgery in advance, they’ll ask you to prepare by not smoking, not eating and not taking certain medications in the hours beforehand. These preparations help to prevent certain surgery complications and make surgery safer for you.\nPrepare you for surgery. When you’re ready for surgery, your team will install an IV line in your arm to deliver fluids and medications. You’ll have general anesthesia for the procedure. Once you’re unconscious, your team will install a breathing tube to help keep your airway open.\nAdvertisement"
    },
    {
      "heading": "What happens during a cholecystectomy?",
      "content": "During a laparoscopic cholecystectomy, your surgeon will:\nMake a small incision, about 2 or 3 centimeters (cm) long, near your belly button.Make two to three additional “keyhole” incisions, about 1 centimeter long, in your upper right abdomen.Insert a small tube into one of the smaller incisions and pump carbon dioxide gas through it to inflate your abdomen. This helps to separate your abdominal walls from your organs.Insert the laparoscope into the larger incision. The laparoscope (a small, lighted camera) projects images to a video monitor above the operating table.Using the video monitor as a guide, insert narrow surgical tools through the one or two remaining incisions to remove your gallbladder.Release the gas from your abdomen and close the incisions with stitches.\nMake a small incision, about 2 or 3 centimeters (cm) long, near your belly button.\nMake two to three additional “keyhole” incisions, about 1 centimeter long, in your upper right abdomen.\nInsert a small tube into one of the smaller incisions and pump carbon dioxide gas through it to inflate your abdomen. This helps to separate your abdominal walls from your organs.\nInsert the laparoscope into the larger incision. The laparoscope (a small, lighted camera) projects images to a video monitor above the operating table.\nUsing the video monitor as a guide, insert narrow surgical tools through the one or two remaining incisions to remove your gallbladder.\nRelease the gas from your abdomen and close the incisions with stitches.\nDuring an open cholecystectomy, your surgeon will:\nMake one incision, about 4 to 6 inches (in) long, underneath your right rib.Use surgical tools to remove your gallbladder.Insert a surgical drain (Jackson Pratt drain) into the wound to drain excess fluids.Close the incision with stitches, leaving the drain in place.\nMake one incision, about 4 to 6 inches (in) long, underneath your right rib.\nUse surgical tools to remove your gallbladder.\nInsert a surgical drain (Jackson Pratt drain) into the wound to drain excess fluids.\nClose the incision with stitches, leaving the drain in place.\nA laparoscopic cholecystectomy normally takes about 60 to 90 minutes. An open cholecystectomy takes about one to two hours. Your procedure might take longer if your surgeon needs to add additional steps to treat your condition. For example, sometimes they might add a bile duct exploration to check for gallstones or other issues in your bile ducts. This way, they can treat these issues at the same time.\nAdvertisement"
    },
    {
      "heading": "What happens after cholecystectomy surgery?",
      "content": "After surgery, you’ll spend a few hours in a recovery room while you wake up from the anesthesia. You’ll have pain medication as needed. If you had a laparoscopic cholecystectomy, you might be able to go home the same day. If you had an open cholecystectomy, you’ll need to spend a few days recovering in the hospital. Your drain may remain in place for a few days. In some cases, you might go home with it."
    },
    {
      "heading": "What are the benefits of cholecystectomy?",
      "content": "Most gallstones develop inside your gallbladder, so removing your gallbladder significantly reduces the chance that you’ll have any more. If gallstones have brought you to the hospital once, they’re likely to do so again. Cholecystectomy is the only treatment that can reliably prevent this. Most people feel it’s easier to have a planned procedure than to expect to have repeat episodes of gallstone emergencies."
    },
    {
      "heading": "What are the risks of cholecystectomy?",
      "content": "There’s always a small risk of complications occurring during surgery. General risks of surgery include:\nInfection.Blood clots.Anesthesia complications.Injury to nearby organs.\nInfection.\nBlood clots.\nAnesthesia complications.\nInjury to nearby organs.\nSpecific risks of cholecystectomy include:\nPancreatitis (irritation of your pancreas).Bile reflux (traces of bile escape into your stomach).Injury to nearby blood vessels, causing excessive bleeding.Bile duct injury, causing bile leakage.\nPancreatitis (irritation of your pancreas).\nBile reflux (traces of bile escape into your stomach).\nInjury to nearby blood vessels, causing excessive bleeding.\nBile duct injury, causing bile leakage."
    },
    {
      "heading": "What is the recovery time from gallbladder removal surgery?",
      "content": "The recovery time from a laparoscopic cholecystectomy is about two weeks. Recovery from an open cholecystectomy takes six to eight weeks. If you still have a drain in your wound, your healthcare team will remove it at your next appointment. Most people can return to work after one to two weeks. But if you do a lot of physical activity, you might need to modify your routine until you’re fully recovered."
    },
    {
      "heading": "Will I have to change my diet after cholecystectomy?",
      "content": "Healthcare providers recommend that you adjust your diet during your recovery period, for several reasons. The first reason is that surgery and general anesthesia can affect your digestive system. The second reason is that gallbladder removal is a change for your digestive system. Your system won’t be getting the bile it needs in quite the same way as it did before, and it’ll need some time to adjust.\nHealthcare providers recommend that you keep your diet simple and bland at first, like you would if you had the flu. The effects of surgery and anesthesia may give you trouble digesting foods with a lot of fiber. The changes to your biliary system may give you some temporary difficulties digesting fats. Your healthcare provider will advise you on how to gradually return to a more normal, healthy diet."
    },
    {
      "heading": "What are the side effects of gallbladder removal surgery?",
      "content": "Most people have only short-term side effects during their recovery. These might include:\nDiarrhea. This can happen as your digestive system adjusts to its new structure.Constipation. This can occur as a side effect of pain medications.Gas and gas pain. This is a side effect of the gas they use in laparoscopic surgery.Nausea. This can be an effect of your pain medications.\nDiarrhea. This can happen as your digestive system adjusts to its new structure.\nConstipation. This can occur as a side effect of pain medications.\nGas and gas pain. This is a side effect of the gas they use in laparoscopic surgery.\nNausea. This can be an effect of your pain medications.\nYour healthcare provider can offer advice on how to manage these short-term conditions.\nA small percentage of people experience longer-lasting symptoms after cholecystectomy. Healthcare providers refer to this phenomenon as post-cholecystectomy syndrome. But these symptoms, and their possible causes, are wide-ranging and don’t really describe a single condition. Post-cholecystectomy syndrome is usually a temporary diagnosis that stands in until a provider can make a more specific one.\nReported symptoms include:\nNausea.Indigestion.Acid reflux.Gas and bloating.Diarrhea.Abdominal pain.Jaundice.\nNausea.\nIndigestion.\nAcid reflux.\nGas and bloating.\nDiarrhea.\nAbdominal pain.\nJaundice.\nMost people have one or a few of these, but not all.\nPossible contributing causes include:\nPreexisting digestive diseases that were previously undiagnosed.Gallstones remaining in your bile ducts, or new ones forming there.Functional disorders of the biliary tract (biliary dyskinesia).Unexplained pain syndromes (visceral hypersensitivity).Complications from surgery, like bile leakage or pancreatitis.\nPreexisting digestive diseases that were previously undiagnosed.\nGallstones remaining in your bile ducts, or new ones forming there.\nFunctional disorders of the biliary tract (biliary dyskinesia).\nUnexplained pain syndromes (visceral hypersensitivity).\nComplications from surgery, like bile leakage or pancreatitis.\nHealthcare providers treat these symptoms and conditions on a case-by-case basis."
    },
    {
      "heading": "When should I see my healthcare provider?",
      "content": "Your healthcare provider will schedule a follow-up appointment with you a few weeks after your surgery to check on your recovery. But be sure to contact them sooner if you develop symptoms of illness, like:\nA fever (over 101 degrees Fahrenheit or 38 degrees Celsius).Excessive or increasing pain.Swelling, skin discoloration or discharge from your incision.Persistent nausea and vomiting.Jaundice.Dark-colored pee (urine) or light-colored poop (stool).\nA fever (over 101 degrees Fahrenheit or 38 degrees Celsius).\nExcessive or increasing pain.\nSwelling, skin discoloration or discharge from your incision.\nPersistent nausea and vomiting.\nJaundice.\nDark-colored pee (urine) or light-colored poop (stool).\nA note from Cleveland Clinic\nThousands of people have successful cholecystectomies each year, most without any complications or side effects. Minimally invasive surgery techniques make recovery easier than ever before. Healthcare providers continue to recommend it as an elective procedure to treat persistent gallbladder diseases, like gallstones. These diseases pose a much higher risk to your health than gallbladder removal does.\nLast reviewed on 10/30/2023.\nLearn more about the Health Library and our editorial process."
    }
  ]
}