{
  "source_url": "https://my.clevelandclinic.org/health/symptoms/8106-nausea--vomiting",
  "chunks": [
    {
      "heading": "What are nausea and vomiting?",
      "content": "You know the feeling. Maybe you ate something your stomach didn’t agree with. Or perhaps you’re going through cancer treatments. It could be one of the first signs that you’re pregnant. That distinct “sick to your stomach,” queasy feeling is a familiar one. Nausea is an uncomfortable feeling in the back of your throat or an uneasiness in your stomach. You may also feel dizzy, lightheaded or have difficulty swallowing. Nausea often goes along with the urge to vomit but doesn’t always lead to vomiting. Vomiting is the forcible emptying (“throwing up”) of stomach contents through your mouth. When you vomit, your stomach muscles squeeze together (contract), propelling your stomach’s contents up through your esophagus and out your mouth. Nausea and vomiting aren’t diseases but rather are symptoms of many different conditions, such as:\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy\nInfections like “stomach flu” (gastroenteritis).Food poisoning.Motion sickness.Pregnancy.Migraines (headache nausea).\nInfections like “stomach flu” (gastroenteritis).\nFood poisoning.\nMotion sickness.\nPregnancy.\nMigraines (headache nausea).\nBoth children and adults can experience nausea and vomiting. People who are undergoing cancer treatments, such as radiation therapy or chemotherapy, have an increased risk of nausea and vomiting. Pregnant people in their first trimester may also experience nausea and vomiting, commonly referred to as “morning sickness.” Researchers estimate that 50% to 90% of pregnant people experience nausea, while 25% to 55% experience vomiting."
    },
    {
      "heading": "What causes nausea and vomiting?",
      "content": "Changes in your immune system and central nervous system can trigger your nausea and vomiting reflexes. Many different things can cause these changes. Some common nausea causes include:\nGastrointestinal (GI) conditions like peptic ulcers, gastritis and gastroparesis.Seasickness and other motion sicknesses.Early pregnancy.Intense pain.Food poisoning.Indigestion (nausea after eating).Infections.Migraine headaches.Vertigo.Certain smells or odors.Overindulgence of alcohol or marijuana.Medications (for example, as a side effect of chemotherapy).\nGastrointestinal (GI) conditions like peptic ulcers, gastritis and gastroparesis.\nSeasickness and other motion sicknesses.\nEarly pregnancy.\nIntense pain.\nFood poisoning.\nIndigestion (nausea after eating).\nInfections.\nMigraine headaches.\nVertigo.\nCertain smells or odors.\nOverindulgence of alcohol or marijuana.\nMedications (for example, as a side effect of chemotherapy).\nUsually, vomiting is harmless, but it can be a sign of a more serious illness. Some examples of serious conditions that may bring on nausea or vomiting include:\nAdvertisement\nConcussions.Encephalitis.Meningitis.Intestinal blockage.Appendicitis.Brain tumors.\nConcussions.\nEncephalitis.\nMeningitis.\nIntestinal blockage.\nAppendicitis.\nBrain tumors."
    },
    {
      "heading": "How can I get rid of nausea?",
      "content": "What helps with nausea is different for every person, but there are several things you can try to control or relieve it. At-home nausea remedies may include:\nDrinking clear and/or ice-cold drinks.Eating light, bland foods (such as saltine crackers or plain bread).Avoiding fried, greasy or sweet foods.Eating slowly and eating smaller, more frequent meals.Not mixing hot and cold foods.Drinking beverages slowly.Avoiding activity after eating.Avoiding brushing your teeth after eating.Choosing foods from all the food groups as you can tolerate them to get adequate nutrition.\nDrinking clear and/or ice-cold drinks.\nEating light, bland foods (such as saltine crackers or plain bread).\nAvoiding fried, greasy or sweet foods.\nEating slowly and eating smaller, more frequent meals.\nNot mixing hot and cold foods.\nDrinking beverages slowly.\nAvoiding activity after eating.\nAvoiding brushing your teeth after eating.\nChoosing foods from all the food groups as you can tolerate them to get adequate nutrition.\nTreatment for vomiting includes:\nDrinking gradually larger amounts of clear liquids.Avoiding solid food until the vomiting episode has passed.Resting.\nDrinking gradually larger amounts of clear liquids.\nAvoiding solid food until the vomiting episode has passed.\nResting.\nYou can often treat vomiting with nausea medication. But you should check with your healthcare provider before using these treatments.\nOne concern with vomiting is dehydration. Adults have a lower risk of becoming dehydrated because they can usually notice the symptoms of dehydration (such as increased thirst and dry lips or mouth). Children have a greater risk of becoming dehydrated, especially if they have vomiting and diarrhea, because they may often be unable to tell an adult if they’re feeling dehydrated. Adults caring for sick children need to be aware of these visible signs of dehydration:\nDry lips and mouth.Sunken eyes.Rapid breathing or pulse.\nDry lips and mouth.\nSunken eyes.\nRapid breathing or pulse.\nIn infants, parents should look for decreased urination and a sunken fontanelle (soft spot on top of your baby’s head)."
    },
    {
      "heading": "How can you prevent nausea?",
      "content": "You may be able to prevent nausea by:\nEating small meals throughout the day instead of three large meals.Eating slowly.Avoiding hard-to-digest foods.Consuming foods that are cold or at room temperature (some people may become nauseated by the smell of hot or warm foods).\nEating small meals throughout the day instead of three large meals.\nEating slowly.\nAvoiding hard-to-digest foods.\nConsuming foods that are cold or at room temperature (some people may become nauseated by the smell of hot or warm foods).\nResting after eating and keeping your head elevated about 12 inches above your feet helps reduce nausea.\nIf you feel nauseated when you wake up in the morning, eat some crackers before getting out of bed or eat a high-protein snack (lean meat or cheese) before going to bed. Drink liquids between (instead of during) meals, and drink at least six to eight 8-ounce glasses of water a day to prevent dehydration. Try to eat when you feel less nauseated.\nYou can sometimes prevent vomiting by drinking small amounts of clear, sweetened liquids such as soda, fruit juices (except orange and grapefruit — they’re too acidic) and ice pops. Rest either in a sitting position or in a propped lying position. Activity might make nausea worse and make you vomit.\nTo treat motion sickness in a car, seat your child so that they face the front windshield, if it’s safe to do so. Watching fast movement out the side windows can make nausea worse.\nAdvertisement\nLimit snacks, and don’t serve sweet snacks with soda. Don’t let your kids eat and play at the same time. Encourage them to take a break during their snack time."
    },
    {
      "heading": "When should nausea and vomiting be treated by a healthcare provider?",
      "content": "You should see your healthcare provider for nausea and vomiting if:\nHome treatment isn’t working.You have symptoms of dehydration.A known injury (such as a head injury or infection) is causing the vomiting.\nHome treatment isn’t working.\nYou have symptoms of dehydration.\nA known injury (such as a head injury or infection) is causing the vomiting.\nTake your infant or child younger than 6 years old to their healthcare provider if:\nVomiting lasts more than a few hours.Diarrhea is also present.They have signs of dehydration.They have a fever higher than 100 degrees Fahrenheit (37.8 degrees Celsius).They haven’t peed (urinated) for six hours.\nVomiting lasts more than a few hours.\nDiarrhea is also present.\nThey have signs of dehydration.\nThey have a fever higher than 100 degrees Fahrenheit (37.8 degrees Celsius).\nThey haven’t peed (urinated) for six hours.\nTake your child over 6 years old to their provider if:\nVomiting lasts one day.Diarrhea combined with vomiting lasts for more than 24 hours.They have signs of dehydration.They have a fever higher than 102 degrees F (38.9 degrees C).They haven’t urinated for six hours.\nVomiting lasts one day.\nDiarrhea combined with vomiting lasts for more than 24 hours.\nThey have signs of dehydration.\nThey have a fever higher than 102 degrees F (38.9 degrees C).\nThey haven’t urinated for six hours.\nAdults should see a healthcare provider if they’re vomiting for more than one day, if diarrhea and vomiting last more than 24 hours and if they have signs of moderate dehydration.\nYou should see a provider immediately if you have these signs or symptoms:\nVomiting blood (“coffee grounds” appearance).Severe headache or stiff neck.Lethargy.Confusion.Decreased alertness.Severe abdominal pain.Vomiting with a fever over 101 degrees F (38.3 degrees C)Vomiting and diarrhea.Rapid breathing or pulse.\nVomiting blood (“coffee grounds” appearance).\nSevere headache or stiff neck.\nLethargy.\nConfusion.\nDecreased alertness.\nSevere abdominal pain.\nVomiting with a fever over 101 degrees F (38.3 degrees C)\nVomiting and diarrhea.\nRapid breathing or pulse.\nAdvertisement"
    },
    {
      "heading": "What if I have constant nausea?",
      "content": "If you’re experiencing constant nausea, you may have a condition known as cyclic vomiting syndrome. With this condition, you can get sudden bouts of severe nausea, vomiting and exhaustion. See your healthcare provider if you have symptoms of cyclic vomiting syndrome, including repeated attacks of extreme nausea, along with retching and vomiting.\nA note from Cleveland Clinic\nIt’s not a fun feeling. Whether you’ve overindulged or you’re battling an infection, nausea and vomiting weren’t on your list of things to deal with today. That queasiness in your stomach may have knocked you down a peg. But thankfully, most cases of nausea and vomiting aren’t serious. With a little rest, some saltine crackers and a few sips of clear liquid, you should be back on your feet in no time.\nAdvertisement\nLast reviewed on 08/09/2023.\nLearn more about the Health Library and our editorial process."
    }
  ]
}