{
  "source_url": "https://my.clevelandclinic.org/health/diseases/3909-alcoholism",
  "chunks": [
    {
      "heading": "What is alcohol use disorder?",
      "content": "Alcohol use disorder (sometimes called alcoholism) is a common medical condition. People with this condition can’t stop drinking, even if their alcohol use upends their lives and the lives of those around them. Alcohol use disorder can be mild, moderate or severe. Treatments may include medication and behavioral therapy. While people with this condition may start drinking again, studies show that with treatment, most people are able to reduce how much they drink or stop drinking entirely.\nAdvertisement\nCleveland Clinic is a non-profit academic medical center. Advertising on our site helps support our mission. We do not endorse non-Cleveland Clinic products or services. Policy"
    },
    {
      "heading": "What are the symptoms of alcohol use disorder?",
      "content": "When you think about medical condition symptoms, you may focus on physical issues like pain, fever or a cough that won’t go away. Alcohol use disorder symptoms focus on changes in your mood and behavior, including:\nCraving beverages containing alcohol.Continuing to use these beverages even though your drinking affects your relationships with your family, friends and colleagues.Drinking more than you intended, or for longer than you intended.Spending lots of time obtaining and drinking these beverages or recovering from hangovers caused by drinking.Repeatedly trying to reduce how much you drink.Repeatedly failing to meet work or family obligations because you’re drinking.Giving up important social, work or recreational activities because of alcohol.Using alcohol in physically hazardous situations.Continuing to drink when you have a medical condition or mental disorder that gets worse when you drink.Having a high tolerance for beverages containing alcohol.Having alcohol withdrawal symptoms or drinking to avoid withdrawal symptoms.\nCraving beverages containing alcohol.\nContinuing to use these beverages even though your drinking affects your relationships with your family, friends and colleagues.\nDrinking more than you intended, or for longer than you intended.\nSpending lots of time obtaining and drinking these beverages or recovering from hangovers caused by drinking.\nRepeatedly trying to reduce how much you drink.\nRepeatedly failing to meet work or family obligations because you’re drinking.\nGiving up important social, work or recreational activities because of alcohol.\nUsing alcohol in physically hazardous situations.\nContinuing to drink when you have a medical condition or mental disorder that gets worse when you drink.\nHaving a high tolerance for beverages containing alcohol.\nHaving alcohol withdrawal symptoms or drinking to avoid withdrawal symptoms.\nThe American Medical Association recommends a two-drink daily limit for people assigned male at birth (AMAB). Heavy drinking in this population is five or more drinks in one day or 15 or more drinks in a week. People assigned female at birth (AFAB) should limit drinking to one drink a day. Heavy drinking in this population is four or more drinks a day or eight drinks a week.\nAdvertisement"
    },
    {
      "heading": "What causes alcohol use disorder?",
      "content": "Researchers don’t know all the reasons why someone develops it, but have identified the following factors:\nGenetics: Studies show people with a family history of alcohol use disorder have an increased risk of developing it.Mental health conditions: Having conditions like depression,post-traumatic stress disorder (PTSD) or attention-deficit/hyperactivity disorder (ADHD) may increase your risk of alcohol use disorder.\nGenetics: Studies show people with a family history of alcohol use disorder have an increased risk of developing it.\nMental health conditions: Having conditions like depression,post-traumatic stress disorder (PTSD) or attention-deficit/hyperactivity disorder (ADHD) may increase your risk of alcohol use disorder."
    },
    {
      "heading": "What are the complications of this condition?",
      "content": "Hangovers and withdrawal are two issues that affect people with alcohol use disorder. But alcohol is a chemical carcinogen. Heavy, long-term consumption of beverages containing alcohol increases your risk of developing esophageal cancer. Other potential complications are:\nAlcohol-induced cardiomyopathy.Alcohol-induced hepatitis.Alcohol poisoning.Cerebellar degeneration.Cirrhosis of the liver.Delirium tremens.\nAlcohol-induced cardiomyopathy.\nAlcohol-induced hepatitis.\nAlcohol poisoning.\nCerebellar degeneration.\nCirrhosis of the liver.\nDelirium tremens."
    },
    {
      "heading": "How is alcohol use disorder diagnosed?",
      "content": "Healthcare providers diagnose the condition by doing a physical examination to look for symptoms of conditions that alcohol use disorder may cause.\nThey’ll use criteria laid out in the Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition (DSM-5), based on the symptoms listed previously. Your provider will determine if you have alcohol use disorder and if your condition is mild, moderate or severe:\nMild: Your symptoms match two to three criteria.Moderate: Symptoms match four to five criteria.Severe: Symptoms match six or more criteria.\nMild: Your symptoms match two to three criteria.\nModerate: Symptoms match four to five criteria.\nSevere: Symptoms match six or more criteria."
    },
    {
      "heading": "What are treatments for alcohol use disorder?",
      "content": "Your treatment depends on your situation. If your condition is severe, your healthcare provider may recommend inpatient medical treatment or residential rehabilitation. Other treatments are:\nBehavioral treatment: This treatment focuses on counseling that changes your drinking behavior. You may work with addiction counselors or psychologists.Medication: The U.S. Food & Drug Administration has approved naltrexone and acamprosate as alcohol use disorder treatment. Topiramate and gabapentin can also decrease cravings in some people.Support groups: Support groups are a way to connect with others who understand your situation.\nBehavioral treatment: This treatment focuses on counseling that changes your drinking behavior. You may work with addiction counselors or psychologists.\nMedication: The U.S. Food & Drug Administration has approved naltrexone and acamprosate as alcohol use disorder treatment. Topiramate and gabapentin can also decrease cravings in some people.\nSupport groups: Support groups are a way to connect with others who understand your situation."
    },
    {
      "heading": "How can I prevent alcohol use disorder?",
      "content": "To prevent alcohol use disorder, avoid high-risk drinking:\nFor people assigned female at birth: No more than four or more drinks in one day or eight or more drinks per week.For people assigned male at birth: No more than five or more drinks in one day or 15 or more drinks per week.\nFor people assigned female at birth: No more than four or more drinks in one day or eight or more drinks per week.\nFor people assigned male at birth: No more than five or more drinks in one day or 15 or more drinks per week.\nIf you drink more alcohol than that, consider cutting back or quitting. Talk to your healthcare provider about proven strategies."
    },
    {
      "heading": "Is there a cure for alcohol use disorder?",
      "content": "Studies show most people with this condition recover, meaning they reduce how much they drink, or stop drinking altogether. People do relapse. They may start drinking to cope with stressful events like losing a job, going through a divorce, or dealing with a death in their family or a close friend. Talk to your healthcare provider if you’re under stress and think you may be at risk for relapse.\nAdvertisement"
    },
    {
      "heading": "How do I take care of myself?",
      "content": "If you’re receiving care for alcohol use disorder, you’ve already taken an important step toward taking care of yourself. Recovery is a journey that you take one step at a time, one day at a time. Here are some suggestions that may help you along the way:\nGet some exercise: Exercise is a great way to manage stress, whether it’s day-to-day challenges or feeling stressed about not drinking alcohol.Know your triggers: With alcohol use disorder, certain circumstances may trigger the urge to have a drink.Seek support: Whether it’s a 12-step program or time with a therapist, it may help to talk with people who understand your situation.\nGet some exercise: Exercise is a great way to manage stress, whether it’s day-to-day challenges or feeling stressed about not drinking alcohol.\nKnow your triggers: With alcohol use disorder, certain circumstances may trigger the urge to have a drink.\nSeek support: Whether it’s a 12-step program or time with a therapist, it may help to talk with people who understand your situation."
    },
    {
      "heading": "When should I see my healthcare provider?",
      "content": "That depends on your situation. For example, if you’re receiving treatment for a condition related to alcohol use, like cirrhosis of the liver, you should ask your healthcare provider about changes in your body that may be new symptoms. If you’re receiving counseling, ask your provider about handling high-stress situations when you may feel like you need some additional mental health support.\nPeople with severe or moderate alcohol use disorder who suddenly stop drinking could develop delirium tremens (DT). This is a severe form of alcohol withdrawal. It can be life-threatening, causing serious medical issues like seizures and hallucinations that require immediate medical care.\nAdvertisement"
    },
    {
      "heading": "What questions should I ask my healthcare provider?",
      "content": "You’ll have many questions as you go through treatment and recovery. Here are some suggestions:\nDo you think I have alcohol use disorder?If so, is it serious?What treatments do you recommend?Will treatment help me stop drinking?\nDo you think I have alcohol use disorder?\nIf so, is it serious?\nWhat treatments do you recommend?\nWill treatment help me stop drinking?"
    },
    {
      "heading": "A note from Cleveland Clinic",
      "content": "If you think you may have alcohol use disorder, you’re not alone. This condition affects millions of people. Realizing you may have an issue is the first step toward getting better, so don’t hesitate to talk to a healthcare provider. They’ll recommend treatments and resources to help you recover from alcohol use disorder.\nAdvertisement\nLast reviewed on 06/11/2024.\nLearn more about the Health Library and our editorial process."
    }
  ]
}